import React from 'react';
import { Platform, View, Text, StyleSheet, Image, ScrollView } from 'react-native';
import { useLanguage } from '../LanguageContext';

const Aboutsection3 = () => {
const { language } = useLanguage();

return(
  <View style={Platform.OS === 'web' ? styles.webcontainer : styles.container}>
    <Image
      source={require('../images/parcham.png')}
      style={styles.backgroundImage}
      resizeMode="contain"
    />
    <View style={styles.overlay} />

    <ScrollView contentContainerStyle={styles.scrollContent}>
      <View style={styles.listContainer}>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 9. Ваколатҳои Комиссия' : 'Статья 9. Полномочия Комиссии'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? ' Комиссия дорои ваколатҳои зерин мебошад: \n 1) интихоботи Президенти Ҷумҳурии Тоҷикистон, аъзои Маҷлиси миллӣ ва вакилони Маҷлиси намояндагони Маҷлиси Олии Ҷумҳурии Тоҷикистон ва раъйпурсии умумихалқиро бо тартиби муқаррарнамудаи қонунгузории Ҷумҳурии Тоҷикистон ташкил ва мегузаронад; \n 2) ба низоми комиссияҳои интихоботӣ роҳбарӣ мекунад; \n 3) ташкил ва гузаронидани интихоботи вакилон ба Маҷлисҳои маҳаллии вакилони халқ ва Ҷамоатро назорат мекунад; \n 4) ҳуқуқи шаҳрвандони Ҷумҳурии Тоҷикистонро оид ба интихобот ва раъйпурсӣ таъмин менамояд; \n 5) риояи принсипҳои раванди интихобот ва раъйпурсиро, ки тибқи Конститутсияи Ҷумҳурии Тоҷикистон ва қонунгузории Ҷумҳурии Тоҷикистон муқаррар гардидаанд, таъмин менамояд; \n 6) татбиқи якхелаи қонунгузории Ҷумҳурии Тоҷикистон дар бораи интихобот ва раъйпурсиро дар ҳудуди Ҷумҳурии Тоҷикистон назорат мекунад; \n 7) шакли бюллетенҳои овоздиҳии интихобот ва раъйпурсиро муқаррар менамояд; \n 8) дар доираи ваколатҳои худ барои татбиқи дуруст ва якхелаи қонунгузории Ҷумҳурии Тоҷикистон дар бораи интихобот ва раъйпурсӣ дастур ва тавзеҳоти ҳатмӣ қабул мекунад; \n 9) мушоҳидони байналмилалиро аз давлатҳои хориҷӣ ва созмонҳои байналмилалӣ мутобиқи қонунгузории Ҷумҳурии Тоҷикистон аккредитатсия менамояд ва ба онҳо шаҳодатномаи шакли муқарраршударо месупорад; \n 10) барои аъзои комиссияҳои интихоботӣ ва комиссияҳои раъйпурсӣ конференсияҳо, семинарҳо ва машғулиятҳои омӯзишӣ ташкил мекунад; \n 11) дар ҳамкорӣ бо вазорату идораҳо ва мақомоти иҷроияи маҳаллии ҳокимияти давлатӣ барои ташкил ва гузаронидани интихобот ва раъйпурсӣ чорабиниҳои дахлдорро мегузаронад; \n 12) барои баланд бардоштани маърифати ҳуқуқии интихобкунандагон, раъйдиҳандагон ва иштирокчиёни дигари маъракаҳои интихоботӣ ва раъйпурсӣ чорабиниҳои зарурӣ ташкил менамояд; \n 13) натиҷаҳои интихобот ва раъйпурсиро ҷамъбаст ва онҳоро эълон мекунад; \n 14) ваколатҳои дигарро, ки қонунҳои конститутсионии Ҷумҳурии Тоҷикистон «Дар бораи интихоботи Президенти Ҷумҳурии Тоҷикистон», «Дар бораи интихоботи Маҷлиси Олии Ҷумҳурии Тоҷикистон», «Дар бораи раъйпурсии Ҷумҳурии Тоҷикистон», «Дар бораи интихоботи вакилон ба Маҷлисҳои маҳаллии вакилони халқ», Қонуни мазкур ва дигар санадҳои меъёрии ҳуқуқии Ҷумҳурии Тоҷикистон пешбинӣ намудаанд, амалӣ менамояд.' : 'Комиссия имеет следующие полномочия: \n 1) организует и проводит выборы Президента Республики Таджикистан, членов Маджлиси милли и депутатов Маджлиси намояндагон Маджлиси Оли Республики Таджикистан, всенародный референдум в порядке, установленном законодательством Республики Таджикистан; \n 2) руководит системой избирательных комиссий; \n 3) осуществляет контроль организации и проведения выборов депутатов в местные Маджлисы народных депутатов и Джамоаты; \n 4) обеспечивает права граждан Республики Таджикистан по выборам и референдуму; \n 5) обеспечивает соблюдение принципов избирательного процесса и процесса референдума, установленных Конституцией Республики Таджикистан и законодательством Республики Таджикистан; \n 6) осуществляет контроль единообразного применения законодательства Республики Таджикистан о выборах и референдумах на территории Республики Таджикистан; \n 7) устанавливает образец избирательных бюллетеней по выборам и референдумам; \n 8) принимает в пределах своих полномочий обязательные инструкции и разъяснения для правильного и единообразного применения законодательства Республики Таджикистан по выборам и референдумам; \n 9) проводит аккредитацию международных наблюдателей от иностранных государств и международных организаций в соответствии с законодательством Республики Таджикистан и выдает им удостоверения установленного образца; \n 10) организует для членов избирательных комиссий и комиссий по референдуму конференции, семинары и обучающие занятия; \n 11) организует совместно с министерствами и ведомствами, местными исполнительными органами государственной власти соответствующие мероприятия для организации и проведения выборов и референдумов; \n 12) организует необходимые мероприятия по повышению правовой культуры избирателей, голосующих и других участников избирательного процесса и процесса референдумов; \n 13) подводит итоги выборов и референдумов и объявляет их результат; \n 14) осуществляет иные полномочия, предусмотренные конституционными законами Республики Таджикистан «О выборах Президента Республики Таджикистан», «О выборах Маджлиси Оли Республики Таджикистан», «О референдуме Республики Таджикистан», «О выборах депутатов в местные Маджлисы народных депутатов», настоящим Законом и другими нормативными правовыми актами Республики Таджикистан.'}
        </Text>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 10. Ваколатҳои раиси Комиссия' : 'Статья 10. Полномочия председателя Комиссии'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? ' 1) Раиси Комиссия дорои ваколатҳои зерин мебошад: \n - ба фаъолияти Комиссия ва дастгоҳи он роҳбарӣ менамояд; \n - ҷаласаҳои Комиссияро даъват менамояд ва дар онҳо раисӣ мекунад, рӯзномаи ҷаласаро барои баррасӣ ва тасдиқи Комиссия пешниҳод менамояд; \n - ба қарорҳо ва протоколҳои Комиссия имзо мегузорад; \n - иҷрои қарорҳои қабулкардаи Комиссияро назорат менамояд; \n - ба муовини раис ва аъзои Комиссия супоришҳои хаттӣ ва шифоҳӣ медиҳад; \n - баррасии муроҷиатҳои шаҳрвандон ва шахсони ҳуқуқиро, ки ба Комиссия ворид мегарданд, таъмин менамояд; \n - намояндагони мақомоти ҳокимияти давлатӣ, ҳизбҳои сиёсӣ, иттиҳодияҳои ҷамъиятӣ, корхонаҳо, муассисаҳо, ташкилотҳои дигар ва шахсони алоҳидаро барои иштирок кардан дар ҷаласаҳои Комиссия даъват менамояд; \n - Комиссияро дар муносибатҳо бо мақомоти ҳокимияти давлатӣ, мақомоти худидоракунии шаҳрак ва деҳот, ҳизбҳои сиёсӣ, иттиҳодияҳои ҷамъиятӣ, корхонаҳо, муассисаҳо ва ташкилотҳои дигар, шахсони мансабдор, созмонҳои байналмилалӣ ва давлатҳои хориҷӣ намояндагӣ мекунад; \n - кормандони дастгоҳи Комиссияро ба вазифа таъин ва аз вазифа озод менамояд; \n - ваколатҳои дигарро, ки Қонуни мазкур ва дигар санадҳои меъёрии ҳуқуқии Ҷумҳурии Тоҷикистон пешбинӣ кардаанд, амалӣ менамояд. \n 2) Раиси Комиссия дар доираи ваколатҳои худ оид ба масъалаҳои фаъолияти Комиссия ва дастгоҳи он фармоиш ва амрҳо қабул менамояд. \n 3) Дар ҳолати ваколатҳояшро амалӣ карда натавонистани раиси Комиссия ё холӣ будани вазифаи раис ваколатҳои раисро муовини раиси Комиссия амалӣ менамояд.' : '1) Председатель Комиссии имеет следующие полномочия: \n – руководит деятельностью Комиссии и его аппарата; \n – созывает заседания Комиссии и председательствует на них, представляет повестку дня заседания на рассмотрение и утверждение Комиссии; \n – подписывает постановления и протоколы Комиссии; \n – осуществляет контроль исполнения принятых решений Комиссии; \n – даёт письменные и устные поручения заместителю председателя и членам Комиссии; \n – обеспечивает рассмотрение обращений граждан и юридических лиц, поступивших в Комиссию; \n – приглашает представителей органов государственной власти, политических партий, общественных объединений, предприятий, учреждений, других организаций и отдельных лиц для участия на заседаниях Комиссии; \n – представляет Комиссию в отношениях с органами государственной власти, органами самоуправления посёлков и сёл, политическими партиями, общественными объединениями, предприятиями, учреждениями и другими организациями, должностными лицами, международными организациями и иностранными государствами; \n – назначает на должность и освобождает от должности сотрудников аппарата Комиссии; \n – осуществляет иные полномочия, предусмотренные настоящим Законом и иными нормативными правовыми актами Республики Таджикистан. \n 2) В пределах своих полномочий председатель Комиссии издаёт приказы и распоряжения по вопросам, касающихся деятельности Комиссии и его аппарата. \n 3) В случае, если председатель Комиссии не может исполнять свои полномочия, или указанная должность председателя вакантна, полномочия председателя исполняются заместителем председателя Комиссии.'}
        </Text>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 11. Ваколатҳои муовини раиси Комиссия' : 'Статья 11. Полномочия заместителя председателя Комиссии'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? ' 1) Муовини раиси Комиссия дорои ваколатҳои зерин мебошад: \n - уҳдадориҳои алоҳидаро, ки аз ваколатҳои Комиссия бармеоянд, иҷро менамояд; \n - иҷрои дастуру супоришҳои раисро дар доираи ваколатҳои худ таъмин мекунад; \n - ваколатҳои дигарро, ки Қонуни мазкур ва дигар санадҳои меъёрии ҳуқуқии Ҷумҳурии Тоҷикистон пешбинӣ кардаанд, амалӣ менамояд. \n 2) Дар ҳолати ваколатҳояшро амалӣ карда натавонистани муовини раиси Комиссия ё холӣ будани вазифаи муовини раис ваколатҳои ӯро котиби Комиссия амалӣ менамояд.' : '1) Заместитель председателя Комиссии имеет следующие полномочия: \n – исполняет отдельные обязанности, вытекающие из полномочий Комиссии; \n – в пределах своих полномочий обеспечивает исполнение поручений и распоряжений председателя; \n – осуществляет иные полномочия, предусмотренные настоящим Законом и иными нормативными правовыми актами Республики Таджикистан. \n 2) В случае, если заместитель председателя Комиссии не может исполнять свои полномочия, или указанная должность заместителя председателя вакантна, полномочия заместителя председателя исполняются секретарем Комиссии.'}
        </Text>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 12. Ваколатҳои котиби Комиссия' : 'Статья 12. Полномочия секретаря Комиссии'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? ' Котиби Комиссия дорои ваколатҳои зерин мебошад: \n 1) корҳои омодагиро ба ҷаласаҳои Комиссия анҷом медиҳад ва аъзои Комиссияро бо маводи баррасишаванда таъмин мекунад; \n 2) протоколҳои ҷаласаҳои Комиссияро тартиб медиҳад ва ба онҳо имзо мегузорад; \n 3) супоришҳои раиси Комиссияро иҷро мекунад; \n 4) роҳбари дастгоҳи Комиссия мебошад; \n 5) ваколатҳои дигарро, ки Қонуни мазкур ва дигар санадҳои меъёрии ҳуқуқии Ҷумҳурии Тоҷикистон пешбинӣ кардаанд, амалӣ менамояд.' : 'Секретарь Комиссии имеет следующие полномочия: \n 1) организует подготовительные работы к заседанию Комиссии и обеспечивает членов Комиссии рассматриваемыми материалами; \n 2) составляет протоколы заседаний Комиссии и подписывает их; \n 3) исполняет поручения председателя Комиссии; \n 4) является руководителем аппарата Комиссии; \n 5) осуществляет иные полномочия, предусмотренные настоящим Законом и иными нормативными правовыми актами Республики Таджикистан.'}
        </Text>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 13. Ҳуқуқу уҳдадориҳои узви Комиссия' : 'Статья 13. Права и обязанности члена Комиссии'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? ' 1) Узви Комиссия дорои ҳуқуқу уҳдадориҳои зерин мебошад: \n - ба рӯзномаи ҷаласаи Комиссия таклиф пешниҳод намояд, вобаста ба масъалаҳои баррасишаванда фикру ақидаҳои худро изҳор намуда, дар музокираҳо иштирок кунад; \n - дар ҷаласаҳои Комиссия иштирок намуда, дар қабули қарорҳо беғаразона овоз диҳад; \n - дар таҳияи санадҳои меъёрии ҳуқуқӣ ва санадҳои дигар вобаста ба ташкил ва гузаронидани интихобот ва раъйпурсӣ, инчунин масъалаҳои дигаре, ки ба ваколати Комиссия дохиланд, иштирок намояд; \n - аз рӯи тақсимот вазифаҳои гузошташударо иҷро намояд; \n - супоришҳои Комиссия, раис ва муовини раисро оид ба назорати кори комиссияҳои интихоботӣ ва комиссияҳои раъйпурсӣ иҷро намояд; \n - бо супориши Комиссия ва раиси Комиссия муроҷиатҳоро баррасӣ намуда, аз натиҷаи он ба Комиссия гузориш диҳад; \n - ваколатҳои дигарро, ки Қонуни мазкур ва дигар санадҳои меъёрии ҳуқуқии Ҷумҳурии Тоҷикистон пешбинӣ кардаанд, амалӣ намояд. \n 2) Узви Комиссия ҳуқуқ надорад дар ташвиқу тарғиби пешазинтихоботии номзадҳои бақайдгирифташуда ва дар раъйпурсӣ вобаста ба масъалаи гузошташуда иштирок намояд.' : '1) Права и обязанности члена Комиссии: \n – представление предложений по повестке дня заседания Комиссии, изложение своих мнений и доводов по обсуждаемым вопросам, участие в прениях; \n – участие в заседаниях Комиссии, объективное голосование по решениям; \n – участие в разработке нормативных правовых актов и других актов по организации и проведению выборов и референдума, а также других вопросов, входящих в полномочия Комиссии; \n – выполнение возложенных на него задач по распределению; \n – исполнение поручений Комиссии, председателя, заместителя председателя по контролю деятельности избирательных комиссий и комиссий по проведению референдума; \n – рассмотрение обращений и представление информации Комиссии о результатах рассмотрения по поручению Комиссии и председателя Комиссии; \n – осуществление иных полномочий, предусмотренных настоящим Законом и другими нормативными правовыми актами Республики Таджикистан. \n Член Комиссии не имеет права участвовать в предвыборной агитации и пропаганде зарегистрированных кандидатов и в агитации по вопросам, вынесенным на референдум.'}
        </Text>
        <Text style={styles.listItem}>
        {language === 'Тоҷики' ? 'Моддаи 14. Фаъолияти меҳнатии узви Комиссия' : 'Статья 14. Трудовая деятельность члена Комиссии'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? ' 1) Раис, муовини раис ва аъзои Комиссия мансаби давлатии ҳокимияти давлатии Ҷумҳурии Тоҷикистон мебошанд. \n 2) Раис, муовини раис ва аъзои Комиссия дар асоси касбӣ ва доимӣ фаъолият менамоянд. Онҳо, ба истиснои фаъолияти илмиву эҷодӣ ва омӯзгорӣ, наметавонанд вазифаи дигареро ишғол кунанд ва бо соҳибкорӣ машғул шаванд. \n 3) Музди меҳнати раис, муовини раис ва аъзои Комиссия аз ҷониби Президенти Ҷумҳурии Тоҷикистон муқаррар карда мешавад. \n 4) Ба раис, муовини раис ва аъзои Комиссия тибқи қонунгузории Ҷумҳурии Тоҷикистон ба муҳлати 45 рӯзи тақвимӣ рухсатии меҳнатии ҳарсолаи пардохтшаванда дода мешавад. \n 5) Нафақаи раис, муовини раис ва аъзои Комиссия бо тартиби муқаррарнамудаи қонунгузории Ҷумҳурии Тоҷикистон таъмин карда мешавад. \n 6) Кафолатҳои моддӣ ва иҷтимоии раис, муовини раис ва аъзои Комиссия, таъминот ва хизматрасонии тиббию иҷтимоии онҳо бо тартиби муқаррарнамудаи қонунгузории Ҷумҳурии Тоҷикистон сурат мегирад.' : '1) Председатель, заместитель председателя и члены Комиссии являются государственной должностью государственной власти Республики Таджикистан. \n 2) Председатель, заместитель председателя и члены Комиссии осуществляют свою деятельность на профессиональной и постоянной основе. Они не могут занимать другую должность, заниматься предпринимательской деятельностью, за исключением научной, творческой и педагогической деятельности. \n 3) Должностной оклад председателя, заместителя председателя и членов Комиссии устанавливается Президентом Республики Таджикистан. \n 4) Председателю, заместителю председателя и членам Комиссии в соответствии с законодательством Республики Таджикистан предоставляется ежегодный оплачиваемый трудовой отпуск сроком 45 календарных дней. \n 5) Пенсионное обеспечение председателя, заместителя председателя и членов Комиссии осуществляется в порядке, установленном законодательством Республики Таджикистан. \n 6) Материальные и социальные гарантии председателя, заместителя председателя и членов Комиссии, медицинское, социальное и иное обеспечение и обслуживание осуществляется в порядке, установленном законодательством Республики Таджикистан.'}
        </Text>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 15. Бозхонди раис, муовини раис ва аъзои Комиссия' : 'Статья 15. Отзыв председателя, заместителя председателя и членов Комиссии'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? ' 1) Раис, муовини раис ва аъзои Комиссия дар асоси пешниҳоди Президенти Ҷумҳурии Тоҷикистон аз ҷониби Маҷлиси намояндагони Маҷлиси Олии Ҷумҳурии Тоҷикистон бозхонд карда мешаванд. \n 2) Раис, муовини раис ва аъзои Комиссия бо асосҳои зерин пеш аз муҳлат бозхонд карда мешаванд: \n - ариза дар бораи бо хоҳиши худ даст кашидан аз узвият; \n - қатъ гаштани шаҳрвандии Ҷумҳурии Тоҷикистон; \n - соҳиб шудан ба шаҳрвандии давлати дигар; \n - барои истиқомати доимӣ аз ҳудуди Ҷумҳурии Тоҷикистон баромадан; \n - мувофиқат накардан ба талаботи моддаи 8 Қонуни мазкур; \n - эътибори қонунӣ пайдо кардани ҳукми айбдоркунандаи суд нисбати ӯ; \n - бо қарори суд бедарак ғоибшуда ё фавтида эълон гардидани ӯ; \n - бе сабабҳои узрнок иштирок накардан дар ҷаласаҳои Комиссия; \n - иштирок кардан дар тарғибу ташвиқи пешазинтихоботии номзадҳои бақайдгирифташуда ва масъалаи дар раъйпурсӣ гузошташуда, инчунин ошкор гардидани ғаразнокии ӯ дар масъалаҳои баррасишаванда; \n - бо сабаби вазъи саломатӣ ё сабабҳои дигари узрнок муддати дуру дароз (на камтар аз чор моҳ пай дар пай) уҳдадориҳои худро иҷро накардани ӯ; \n - риоя накардани талаботи Қонуни Ҷумҳурии Тоҷикистон «Дар бораи танзими анъана ва ҷашну маросим дар Ҷумҳурии Тоҷикистон»; \n - бо сабаби ба кори дигар гузаштан; \n - дар ҳолати вафоти ӯ. \n 3) Ҳангоми ба вуҷуд омадани асосҳои дар қисми 2 моддаи мазкур пешбинишуда, то баррасии масъалаи пеш аз муҳлат бозхонд намудани раис, муовини раис ва аъзои Комиссия ваколатҳои онҳо бо қарори Комиссия боз дошта мешаванд.' : '1) Председатель, заместитель председателя и члены Комиссии отзываются по представлению Президента Республики Таджикистан Маджлиси намояндагон Маджлиси Оли Республики Таджикистан. \n 2) Председатель, заместитель председателя и члены Комиссии досрочно отзываются по следующим основаниям: \n – заявление об отказе от членства по собственному желанию; \n – прекращение гражданства Республики Таджикистан; \n – получение гражданства другого государства; \n – выезд за пределы Республики Таджикистан для постоянного проживания; \n – несоответствие требованиям статьи 8 настоящего Закона; \n – вступление в законную силу обвинительного приговора суда в его отношении; \n – решением суда, признанным безвестно отсутствующим или объявленным умершим; \n – не участвовать в заседаниях Комиссии без уважительных причин; \n – участие в предвыборной агитации и пропаганде зарегистрированных кандидатов и по вопросам, вынесенным на референдум, а также выявление его небеспристрастности в рассматриваемых вопросах; \n – неисполнение своих обязанностей в течение длительного времени (не менее четырех месяцев непрерывно) по состоянию здоровья или иным уважительным причинам; \n – несоблюдение требований Закона Республики Таджикистан «Об упорядочении традиций, торжеств и обрядов в Республике Таджикистан»; \n – в связи с переходом на другую работу; \n – в случае смерти. \n В случае возникновения оснований, предусмотренных частью 2 настоящей статьи, до рассмотрения вопроса о досрочном отзыве председателя, заместителя председателя и члена Комиссии, их полномочия приостанавливаются решением Комиссии.'}
        </Text>
      </View>
    </ScrollView>
  </View>
  );
};

const styles = StyleSheet.create({
  webcontainer:{
    height: '100vh',
    overflow: 'scroll',
    paddingBottom: "20px",
    overflowX: 'hidden',
  },
  container: {
    flex: 1,
  },
  backgroundImage: {
    position: 'absolute',
    top: '30%',
    width: '150%',
    left: -50,
    height: '40%',
    opacity: 0.4,
  },
  overlay: {
    ...StyleSheet.absoluteFillObject,
    backgroundColor: 'rgba(255, 255, 255, 0.5)',
  },
  scrollContent: {
    paddingHorizontal: 20,
    paddingTop: 20,
  },
  listContainer: {
    alignItems: 'flex-start',
  },
  listItem: {
    fontSize: 23.6,
    fontWeight: 'bold',
    color: '#000',
    marginBottom: 15,
  },
  textItem: {
    fontSize: 22,
    marginBottom: 15,
  },
});

export default Aboutsection3;