import React from 'react';
import { Platform, View, Text, StyleSheet, Image, ScrollView } from 'react-native';
import { useLanguage } from '../LanguageContext';

const Aboutsection1 = () => {
const { language } = useLanguage();

return(
  <View style={Platform.OS === 'web' ? styles.webcontainer : styles.container}>
    <Image
      source={require('../images/parcham.png')}
      style={styles.backgroundImage}
      resizeMode="contain"
    />
    <View style={styles.overlay} />

    <ScrollView contentContainerStyle={styles.scrollContent}>
      <View style={styles.listContainer}>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 1. Комиссияи марказии интихобот ва раъйпурсии Ҷумҳурии Тоҷикистон' : 'Статья 1. Центральная комиссия по выборам и референдумам Республики Таджикистан'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? '1) Комиссияи марказии интихобот ва раъйпурсии Ҷумҳурии Тоҷикистон (минбаъд – Комиссия) мақоми давлатии Ҷумҳурии Тоҷикистон буда, интихоботи Президенти Ҷумҳурии Тоҷикистон, аъзои Маҷлиси миллӣ, вакилони Маҷлиси намояндагони Маҷлиси Олии Ҷумҳурии Тоҷикистон ва раъйпурсии умумихалқиро ташкил мекунад ва мегузаронад, ба низоми комиссияҳои интихоботӣ роҳбарӣ мекунад, инчунин ташкил ва гузаронидани интихоботи вакилон ба Маҷлисҳои маҳаллии вакилони халқ ва Ҷамоатро назорат карда, риоя ва татбиқи якхелаи қонунгузории Ҷумҳурии Тоҷикистон дар бораи интихобот ва раъйпурсиро таъмин менамояд. \n 2) Комиссия мақоми дастаҷамъӣ буда, ҳангоми амалӣ намудани ваколатҳои худ мустақил мебошад, ба мақомоти ҳокимияти давлатӣ, мақомоти худидоракунии шаҳрак ва деҳот ва шахсони мансабдор ҳисоботдиҳанда намебошад. \n 3) Комиссия шахси ҳуқуқӣ буда, дорои суратҳисоб ва ҳисобҳои дигар, муҳру бланкҳо бо ифодаи номи худ ва тасвири Нишони давлатии Ҷумҳурии Тоҷикистон мебошад.' : '1) Центральная комиссия по выборам и референдумам Республики Таджикистан (далее – Комиссия) является государственным органом Республики Таджикистан, организует и проводит выборы Президента Республики Таджикистан, членов Маджлиси милли, депутатов Маджлиси намояндагон Маджлиси Оли Республики Таджикистан и всенародный референдум, руководит системой избирательных комиссий, а также осуществляет надзор за организацией и проведением выборов депутатов в местные Маджлисы народных депутатов и Джамоаты, обеспечивает соблюдение и единообразное исполнение законодательства Республики Таджикистан о выборах и референдумах. \n 2) Комиссия является коллегиальным органом и при осуществлении своих полномочий независима и неподотчетна органам государственной власти, органам самоуправления посёлков и сёл и должностным лицам. \n 3) Комиссия является юридическим лицом, имеет расчетный и иные счета, печать и бланки со своим наименованием и с изображением Государственного герба Республики Таджикистан.'}
        </Text>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 2. Қонунгузории Ҷумҳурии Тоҷикистон дар бораи Комиссияи марказии интихобот ва раъйпурсӣ' : 'Статья 2. Законодательство Республики Таджикистан о Центральной комиссии по выборам и референдумам'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? 'Қонунгузории Ҷумҳурии Тоҷикистон дар бораи Комиссияи марказии интихобот ва раъйпурсӣ ба Конститутсияи Ҷумҳурии Тоҷикистон асос ёфта, аз Қонуни мазкур ва дигар санадҳои меъёрии ҳуқуқии Ҷумҳурии Тоҷикистон, инчунин санадҳои ҳуқуқии байналмилалие, ки Тоҷикистон онҳоро эътироф намудааст, иборат мебошад.' : 'Законодательство Республики Таджикистан о Центральной комиссии по выборам и референдумам основывается на Конституции Республики Таджикистан и состоит из настоящего Закона, других нормативных правовых актов Республики Таджикистан, а также международных правовых актов, признанных Таджикистаном.'}
        </Text>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 3. Принсипҳои фаъолияти Комиссия' : 'Статья 3. Принципы деятельности Комиссии'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? 'Комиссия дар фаъолияти худ принсипҳои демократии низоми интихобот ва раъйпурсиро амалӣ намуда, барои изҳори озодонаи иродаи интихобкунандагон ва раъйдиҳандагон шароити мусоид фароҳам меорад.' : 'В своей деятельности Комиссия осуществляет демократические принципы избирательной системы и референдума, обеспечивает благоприятные условия для свободного волеизъявления избирателей и голосующих.'}
        </Text>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 4. Ошкорбаёнӣ дар фаъолияти Комиссия' : 'Статья 4. Гласность в деятельности Комиссии'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? '1) Комиссия фаъолияти худро ба таври шаффоф амалӣ менамояд. Ҷаласаҳои Комиссия ошкоро гузаронида шуда, барои аҳли ҷомеа ва воситаҳои ахбори омма дастрас мебошанд. \n 2) Комиссия дар бораи ҳайат ва қароргоҳи худ, ҷаласаҳо ва қарорҳои дар онҳо қабулгардида, инчунин чорабиниҳое, ки мегузаронад, дар воситаҳои ахбори омма иттилоъ медиҳад.' : '1) Комиссия осуществляет свою деятельность прозрачно. Заседания Комиссии проводятся гласно и являются доступными для общества и средств массовой информации. \n 2) Комиссия информирует через средства массовой информации о своём составе и местонахождении, о заседаниях и принятых на них решениях, а также о проводимых мероприятиях.'}
        </Text>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 5. Макони ҷойгиршавии Комиссия' : 'Статья 5. Местонахождение Комиссии'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? '1) Макони ҷойгиршавии Комиссия пойтахти Ҷумҳурии Тоҷикистон - шаҳри Душанбе мебошад. \n 2) Дар бинои Комиссия Парчами давлатии Ҷумҳурии Тоҷикистон афрохта мешавад.' : '1) Местонахождением Комиссии является столица Республики Таджикистан – город Душанбе. \n 2) В здании Комиссии вывешивается Государственный флаг Республики Таджикистан.'}
        </Text>
      </View>
    </ScrollView>
  </View>
  );
};

const styles = StyleSheet.create({
  webcontainer:{
    height: '100vh',
    overflow: 'scroll',
    paddingBottom: "20px",
    overflowX: 'hidden',
  },
  container: {
    flex: 1,
  },
  backgroundImage: {
    position: 'absolute',
    top: '30%',
    width: '150%',
    left: -50,
    height: '40%',
    opacity: 0.4,
  },
  overlay: {
    ...StyleSheet.absoluteFillObject,
    backgroundColor: 'rgba(255, 255, 255, 0.5)',
  },
  scrollContent: {
    paddingHorizontal: 20,
    paddingTop: 20,
  },
  listContainer: {
    alignItems: 'flex-start',
  },
  listItem: {
    fontSize: 23.6,
    fontWeight: 'bold',
    color: '#000',
    marginBottom: 15,
  },
  textItem: {
    fontSize: 22,
    marginBottom: 15,
  },
});

export default Aboutsection1;