import React from 'react';
import { Platform, View, Text, StyleSheet, Image, ScrollView } from 'react-native';
import { useLanguage } from '../LanguageContext';

const Aboutsection4 = () => {
const { language } = useLanguage();

return(
  <View style={Platform.OS === 'web' ? styles.webcontainer : styles.container}>
    <Image
      source={require('../images/parcham.png')}
      style={styles.backgroundImage}
      resizeMode="contain"
    />
    <View style={styles.overlay} />

    <ScrollView contentContainerStyle={styles.scrollContent}>
      <View style={styles.listContainer}>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 16. Ташкили фаъолияти Комиссия' : 'Статья 16. Организация деятельности Комиссии'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? ' Фаъолияти Комиссия тибқи Қонуни мазкур, санадҳои дигари қонунгузории Ҷумҳурии Тоҷикистон, Дастури Комиссия, инчунин санадҳое, ки Комиссия қабул кардааст, ташкил карда мешавад.' : ' Деятельность Комиссии организуется в соответствии с настоящим Законом, другими законодательными актами Республики Таджикистан, Регламентом Комиссии, а также актами, принятыми Комиссией.'}
        </Text>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 17. Шакли фаъолияти Комиссия' : 'Статья 17. Форма деятельности Комиссии'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? ' 1) Фаъолияти Комиссия дар шакли ҷаласаҳо сурат мегирад. Дар ҷаласаҳо масъалаҳое, ки ба ваколати Комиссия дохиланд, мавриди баррасӣ қарор дода мешаванд. \n 2) Ҷаласаҳои Комиссия аз рӯи зарурат ва дар давраи интихобот ва раъйпурсӣ на камтар аз як маротиба дар як моҳ гузаронида мешаванд. \n 3) Ҷаласаҳои Комиссия дар сурати ҳузур доштани на камтар аз се ду ҳиссаи аъзои Комиссия баргузор мегарданд.' : '1) Деятельность Комиссии осуществляется в форме заседания. На заседаниях рассматриваются вопросы, относящиеся к полномочиям Комиссии. \n 2) Заседания Комиссии созываются по необходимости, а во время выборов и референдума не менее одного раза в месяц. \n 3) Заседания Комиссии проводятся в случае присутствия не менее двух третей членов Комиссии.'}
        </Text>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 18. Қарорҳои Комиссия' : 'Статья 18. Постановления Комиссии'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? ' 1) Комиссия аз рӯи натиҷаи баррасии масъалаҳо қарор қабул намуда, иҷрои онро назорат мекунад. \n 2) Қарори Комиссия бо овоздиҳии ошкоро ва тарафдории аз нисф зиёди аъзои Комиссия қабул карда мешавад. Дар сурати баробар будани овозҳо, овози раисикунандаи ҷаласа ҳалкунанда мебошад.' : '1) По результатам рассмотрения вопросов Комиссия принимает постановления и контролирует их исполнение. \n 2) Постановления Комиссии принимаются открытым голосованием и поддержкой более половины членов Комиссии. В случае равенства голосов, голос председательствующего является решающим.'}
        </Text>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 19. Иҷрои қарорҳои Комиссия' : 'Статья 19. Исполнение постановлений Комиссии'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? ' 1) Иҷрои қарорҳои Комиссия, ки дар доираи ваколаташ қабул шудаанд, барои мақомоти давлатӣ, мақомоти худидоракунии шаҳрак ва деҳот, ҳизбҳои сиёсӣ, иттиҳодияҳои ҷамъиятӣ, корхонаҳо, муассисаҳо, ташкилотҳои дигар ва шахсони мансабдор, номзадҳо, интихобкунандагон, ҳамчунин барои ҳамаи комиссияҳои интихобот ва раъйпурсӣ ҳатмӣ мебошанд. \n 2) Нисбат ба қарори Комиссия бо тартиби муқарраргардида ба Суди Олии Ҷумҳурии Тоҷикистон дар давоми даҳ рӯзи баъди қабули он шикоят кардан мумкин аст. \n 3) Комиссия ҳуқуқ дорад, ки доир ба масъалаҳои тайёрӣ ва гузаронидани интихобот ва раъйпурсӣ ба мақомоти давлатӣ, мақомоти худидоракунии шаҳрак ва деҳот, ҳизбҳои сиёсӣ, иттиҳодияҳои ҷамъиятӣ, корхонаҳо, муассисаҳо, ташкилотҳои дигар, шахсони мансабдор муроҷиат кунад ва онҳо уҳдадоранд, ки онро баррасӣ карда, ба Комиссия дар муҳлати на дертар аз се рӯз ҷавоб диҳанд.' : ' 1) Исполнение постановлений Комиссии, принятые в пределах ее полномочий, обязательны для всех государственных органов, органов самоуправления посёлков и сёл, политических партий, общественных объединений, предприятий, учреждений, других организаций и долж­ностных лиц, кандидатов, избирателей, а также всех избирательных комиссий и комиссий по проведению референдума. \n 2) Постановления Комиссии в установленном порядке могут быть обжалованы в Верховный Суд Республики Таджикистан в течение десяти дней после их принятия. \n 3) Комиссия имеет право обратиться по вопросам, связанным с подготовкой и проведением выборов и референдума, в государственные органы, органы самоуправления посёлков и сёл, политические партии, общественные объединения, предприятия, учреждения, другие организации и к должностным лицам, которые обязаны рассмотреть и дать ответ Комиссии не позднее чем в трехдневный срок.'}
        </Text>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 20. Тартиби пешниҳоди муроҷиатҳо ба Комиссия' : 'Статья 20. Порядок представления обращений в Комиссию'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? ' Шаҳрвандон ва шахсони ҳуқуқии Ҷумҳурии Тоҷикистон ҳуқуқ доранд ба Комиссия аз рӯи масъалаҳои ба ваколатҳои он дахлдошта муроҷиат намоянд. Муроҷиатҳо бо тартиби муқаррарнамудаи Қонуни мазкур, санадҳои қонунгузорӣ дар бораи интихобот ва раъйпурсӣ, инчунин дигар санадҳои меъёрии ҳуқуқии Ҷумҳурии Тоҷикистон баррасӣ карда мешаванд.' : ' Граждане и юридические лица Республики Таджикистан имеют право обращаться в Комиссию по вопросам, относящимся к ее компетенции. Обращения рассматриваются в порядке, установленном настоящим Законом, законодательными актами о выборах и референдуме, а также другими нормативными правовыми актами Республики Таджикистан.'}
        </Text>
        <Text style={styles.listItem}>
        {language === 'Тоҷики' ? 'Моддаи 21. Уҳдадориҳои вазорату идораҳои Ҷумҳурии Тоҷикистон дар ташкил ва баргузории интихобот ва раъйпурсӣ' : 'Статья 21. Обязанности министерств и ведомств Республики'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? ' Вазорату идораҳои Ҷумҳурии Тоҷикистон уҳдадоранд дар ташкил ва баргузории интихобот ва раъйпурсӣ тибқи қонунгузории Ҷумҳурии Тоҷикистон ба Комиссия мусоидат намоянд.' : ' Министерства и ведомства Республики Таджикистан при организации и проведении выборов и референдумов обязаны содействовать Комиссии в соответствии с законодательством Республики Таджикистан.'}
        </Text>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 22. Уҳдадориҳои мақомоти иҷроияи маҳаллии ҳокимияти давлатӣ дар ташкил ва баргузории интихобот ва раъйпурсӣ' : 'Статья 22. Обязанности местных исполнительных органов государственной власти при организации и проведении выборов и референдума'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? ' Мақомоти иҷроияи маҳаллии ҳокимияти давлатӣ дар ташкил ва баргузории интихобот ва раъйпурсӣ уҳдадоранд: \n 1) дар муҳлат ва тартиби муқаррарнамудаи Комиссия маълумоти дахлдорро оид ба шаҳрвандони Ҷумҳурии Тоҷикистон, ки дар ҳудуди шаҳру ноҳияҳои дахлдор истиқомат карда, ҳуқуқи интихоб кардан ва раъй доданро доранд, пешниҳод намоянд; \n 2) барои комиссияҳои дахлдори интихоботӣ ва раъйпурсӣ ҷойҳои мувофиқро барои ҷойгиршавӣ ва баргузории интихобот ва раъйпурсӣ ҷудо намоянд; \n 3) комиссияҳои дахлдори интихобот ва раъйпурсиро бо таҷҳизоти зарурӣ таъмин намоянд; \n 4) ба комиссияҳои дахлдори интихоботӣ барои баргузории вохӯрии номзадҳо ба мансаби Президенти Ҷумҳурии Тоҷикистон, узви Маҷлиси миллӣ ва вакили Маҷлиси намояндагони Маҷлиси Олии Ҷумҳурии Тоҷикистон, вакили Маҷлисҳои маҳаллии вакилони халқ, шахсони боэътимоди онҳо бо интихобкунандагон, инчунин вохӯрии гурӯҳҳои таблиғотиро оид ба масъалаҳои дар раъйпурсӣ гузошташуда бо овоздиҳандагон толорҳои дахлдор ва ҷойи мувофиқ ҷудо намоянд; \n 5) бо тартиби муқарраргардида номзадҳоро ба аъзои комиссияҳои ҳавзавии интихоботӣ ва раъйпурсӣ, инчунин комиссияҳои участкавии интихоботӣ ва раъйпурсӣ пешниҳод намоянд; \n 6) уҳдадориҳои дигарро, ки дар қонунҳои конститутсионӣ оид ба интихобот ва раъйпурсӣ ва дигар санадҳои қонунгузории Ҷумҳурии Тоҷикистон пешбинӣ гардидаанд, иҷро намоянд.' : ' Местные исполнительные органы государственной власти при организации и проведении выборов и референдумов обязаны: \n – предоставлять в сроки и в порядке, установленные Комиссией, соответствующую информацию о гражданах Республики Таджикистан, проживающих на территории соответствующего города и района, имеющих право избирать и голосовать; \n – выделять для соответствующих комиссий по выборам и референдумам соответствующие помещения для размещения и проведения выборов и референдума; \n – обеспечивать соответствующие комиссии по выборам и референдумам необходимым оборудованием; \n – выделять соответствующие залы и надлежащие места соответствующим комиссиям по выборам для организации встреч кандидатов в Президенты Республики Таджикистан, члены Маджлиси милли и депутаты Маджлиси намояндагон Маджлиси Оли Республики Таджикистан, депутаты в местные Маджлисы народных депутатов, их доверенных лиц с избирателями, а также для встреч агитационных групп, по вопросам, вынесенным на референдум с голосующими; \n – представлять в установленном порядке кандидатов в члены окружных избирательных комиссий и окружных комиссий по референдуму, а также участковых избирательных комиссий и участковых комиссий по референдуму; \n – выполнять другие обязанности, предусмотренные конституционными законами о выборах и референдуме и другими законодательными актами Республики Таджикистан.'}
        </Text>
      </View>
    </ScrollView>
  </View>
  );
};

const styles = StyleSheet.create({
  webcontainer:{
    height: '100vh',
    overflow: 'scroll',
    paddingBottom: "20px",
    overflowX: 'hidden',
  },
  container: {
    flex: 1,
  },
  backgroundImage: {
    position: 'absolute',
    top: '30%',
    width: '150%',
    left: -50,
    height: '40%',
    opacity: 0.4,
  },
  overlay: {
    ...StyleSheet.absoluteFillObject,
    backgroundColor: 'rgba(255, 255, 255, 0.5)',
  },
  scrollContent: {
    paddingHorizontal: 20,
    paddingTop: 20,
  },
  listContainer: {
    alignItems: 'flex-start',
  },
  listItem: {
    fontSize: 23.6,
    fontWeight: 'bold',
    color: '#000',
    marginBottom: 15,
  },
  textItem: {
    fontSize: 22,
    marginBottom: 15,
  },
});

export default Aboutsection4;