import React from 'react';
import { Platform, View, Text, StyleSheet, Image, ScrollView } from 'react-native';
import { useLanguage } from '../LanguageContext';

const Aboutsection2 = () => {
const { language } = useLanguage();

return(
  <View style={Platform.OS === 'web' ? styles.webcontainer : styles.container}>
    <Image
      source={require('../images/parcham.png')}
      style={styles.backgroundImage}
      resizeMode="contain"
    />
    <View style={styles.overlay} />

    <ScrollView contentContainerStyle={styles.scrollContent}>
      <View style={styles.listContainer}>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 6. Тартиби таъсис ва ҳайати Комиссия' : 'Статья 6. Порядок образования и состав Комиссии'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? '1) Комиссия дар ҳайати 7 нафар аъзо, аз ҷумла раис, муовин ва 5 нафар аъзо бо пешниҳоди Президенти Ҷумҳурии Тоҷикистон аз ҷониби Маҷлиси намояндагони Маҷлиси Олии Ҷумҳурии Тоҷикистон интихоб карда мешавад. \n 2) Котиби Комиссия аз ҳисоби аъзои он дар ҷаласаи Комиссия интихоб карда мешавад. \n 3) Узви Комиссия чун қоида бояд дорои таҳсилоти олии ҳуқуқшиносӣ ё сиёсатшиносӣ бошад.' : '1) Комиссия избирается в составе 7 членов, в том числе председателя, заместителя и 5 членов, по представлению Президента Республики Таджикистан со стороны Маджлиси намояндагон Маджлиси Оли Республики Таджикистан. \n 2) Секретарь Комиссии избирается на заседании Комиссии из числа ее членов. \n 3) Член Комиссии, как правило, должен иметь высшее юридическое или политологическое образование.'}
        </Text>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 7. Муҳлати ваколати узви Комиссия.' : 'Статья 7. Срок полномочий члена Комиссии'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? 'Муҳлати ваколати узви Комиссия 7 сол мебошад.' : 'Срок полномочий члена Комиссии составляет 7 лет.'}
        </Text>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 8. Узвият дар Комиссия' : 'Статья 8. Членство в Комиссии'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? '1) Узви Комиссия шахсе интихоб шуда метавонад, ки танҳо шаҳрвандии Ҷумҳурии Тоҷикистонро дошта бошад, синни ӯ аз 30 кам набуда, дорои таҳсилоти олӣ бошад, дар ҳудуди Ҷумҳурии Тоҷикистон 5 соли охир истиқомати доимӣ дошта, забони давлатиро донад. \n 2) Шаҳрвандони зерин ба ҳайати Комиссия интихоб шуда наметавонанд: \n - номзадҳо ба мансаби Президенти Ҷумҳурии Тоҷикистон; \n - номзадҳо ба узви Маҷлиси миллӣ ва вакили Маҷлиси намояндагони Маҷлиси Олии Ҷумҳурии Тоҷикистон; \n - номзадҳо ба вакили Маҷлисҳои маҳаллии вакилони халқ ва Ҷамоат; \n - узви Маҷлиси миллии Маҷлиси Олии Ҷумҳурии Тоҷикистон; \n - вакили Маҷлисҳои маҳаллии вакилони халқ ва Ҷамоат; \n - узви ҳизби сиёсӣ; \n - шахсони боэътимоди номзадҳо ба мансаби Президенти Ҷумҳурии Тоҷикистон, ба узви Маҷлиси миллӣ, ба вакилии Маҷлиси намояндагони Маҷлиси Олии Ҷумҳурии Тоҷикистон ва ба вакилии Маҷлисҳои маҳаллии вакилони халқ; \n - шаҳрвандоне, ки суд қобилияти амали онҳоро маҳдуд ё онҳоро ғайри қобили амал эътироф кардааст; \n - ходимони касбии иттиҳодияҳои динӣ; \n - шаҳрвандоне, ки барои ҷиноятҳои аз беэҳтиётӣ содиркардаашон доғи судӣ доранд, инчунин шаҳрвандоне, ки барои содир кардани ҷиноятҳои қасдона маҳкум шудаанд ё дар асоси моддаи 32 Кодекси мурофиавии ҷиноятии Ҷумҳурии Тоҷикистон барои содир намудани ҷиноятҳои вазнин ва махсусан вазнин аз ҷавобгарии ҷиноятӣ озод шудаанд; \n - нафақагири давлати хориҷӣ. \n 3) Шаҳрванде, ки узви ҳизби сиёсӣ мебошад, дар ҳолате номзад ба аъзои Комиссия пешниҳод мегардад, ки бо тартиби муқарраргардида узвияташро дар ҳизби сиёсӣ қатъ намуда бошад.' : '1) Членом Комиссии может быть избрано лицо не моложе 30 лет, имеющее только гражданство Республики Таджикистан, высшее образование, постоянно проживающее на территории Республики Таджикистан 5 последних лет и владеющее государственным языком. \n 2) В члены Комиссии не избираются следующие граждане: \n – кандидаты на должность Президента Республики Таджикистан; \n – кандидаты в члены Маджлиси милли и депутаты Маджлиси намояндагон Маджлиси Оли Республики Таджикистан; \n – кандидаты в депутаты местных Маджлисов народных депутатов и Джамоаты; \n – члены Маджлиси милли Маджлиси Оли Республики Таджикистан; \n – депутаты местных Маджлисов народных депутатов и Джамоатов; \n – члены политических партий; \n – доверенные лица кандидатов на должность Президента Республики Таджикистан, в члены Маджлиси милли и в депутаты Маджлиси намояндагон Маджлиси Оли Республики Таджикистан и в депутаты в местные Маджлисы народных депутатов; \n – граждане, признанные судом ограниченно дееспособными или недееспособными; \n – профессиональные деятели религиозных объединений; \n – граждане, имеющие судимость за преступления, совершенные по неосторожности, а также граждане, осужденные за совершение умышленного преступления или на основании статьи 32 Уголовно – процессуального кодекса Республики Таджикистан освобождены от уголовной ответственности за совершение тяжких и особо тяжких преступлений; \n – пенсионеры иностранных государств. \n 3) Гражданин, являющийся членом политической партии, предлагается в члены Комиссии в том случае, если в установленном порядке прекратил свое членство в политической партии.'}
        </Text>
      </View>
    </ScrollView>
  </View>
  );
};

const styles = StyleSheet.create({
  webcontainer:{
    height: '100vh',
    overflow: 'scroll',
    paddingBottom: "20px",
    overflowX: 'hidden',
  },
  container: {
    flex: 1,
  },
  backgroundImage: {
    position: 'absolute',
    top: '30%',
    width: '150%',
    left: -50,
    height: '40%',
    opacity: 0.4,
  },
  overlay: {
    ...StyleSheet.absoluteFillObject,
    backgroundColor: 'rgba(255, 255, 255, 0.5)',
  },
  scrollContent: {
    paddingHorizontal: 20,
    paddingTop: 20,
  },
  listContainer: {
    alignItems: 'flex-start',
  },
  listItem: {
    fontSize: 23.6,
    fontWeight: 'bold',
    color: '#000',
    marginBottom: 15,
  },
  textItem: {
    fontSize: 23,
    marginBottom: 15,
  },
});

export default Aboutsection2;