import React from 'react';
import { Platform, View, Text, StyleSheet, Image, ScrollView } from 'react-native';
import { useLanguage } from '../LanguageContext';

const Section2Page2 = () => {
    const { language } = useLanguage();

    return (
        <View style={Platform.OS === 'web' ? styles.webcontainer : styles.container}>
            <Image
                source={require('../images/parcham.png')}
                style={styles.backgroundImage}
                resizeMode="contain"
            />
            <View style={styles.overlay} />

            <ScrollView contentContainerStyle={styles.scrollContent}>
                <View style={styles.listContainer}>
                    <Text style={styles.listItem}>
                        {language === 'Тоҷики' ? 'Моддаи 1. Принсипҳои асосии интихобот' : 'Статья 1. Основные принципы выборов'}
                    </Text>
                    <Text style={styles.textItem}>
                        {language === 'Тоҷики' ? ' Интихобот ба Маҷлисҳои вакилони халқи Вилояти Мухтори Кӯҳистони Бадахшон, вилоят, шаҳри Душанбе, шаҳр ва ноҳия дар ҳавзаҳои ҳудудии якмандатии интихобот дар асоси ҳуқуқи интихоботии умумӣ, баробар ва мустақим бо овоздиҳии пинҳонӣ ба мӯҳлати панҷ сол гузаронида мешавад. (ҚКҶТ аз 26.07.14 с., № 1087)' : ' Выборы в Маджлис народных депутатов Горно-Бадахшанской автономной области, областей, города Душанбе, городов и районов Маджлисы народных депутатов проводятся по территориальным одномандатным избирательным округам на основе всеобщего, равного и прямого избирательного права при тайном голосовании сроком на пять лет. (КЗРТ от 26.07.14 г., № 1087)'}
                    </Text>
                    <Text style={styles.listItem}>
                        {language === 'Тоҷики' ? 'Моддаи 1\u00B9. Қонунгузории Ҷумҳурии Тоҷикистон дар бораи интихоботи вакилон ба Маҷлисҳои маҳаллии вакилони халқ' : 'Статья 1\u00B9. Законодательство Республики Таджикистан о выборах депутатов в местные Маджлисы народных депутатов'}
                    </Text>
                    <Text style={styles.textItem}>
                        {language === 'Тоҷики' ? ' Қонунгузории Ҷумҳурии Тоҷикистон дар бораи интихоботи вакилон ба Маҷлисҳои маҳаллии вакилони халқ ба Конститутсияи Ҷумҳурии Тоҷикистон асос ёфта, аз Қонуни конститутсионии мазкур, дигар санадҳои меъёрии ҳуқуқии Ҷумҳурии Тоҷикистон, инчунин санадҳои ҳуқуқии байналмилалие, ки Тоҷикистон онҳоро эътироф намудааст, иборат мебошад. (ҚКҶТ аз 26.07.14 с., № 1087), (ҚКҶТ аз 30.05.2017 с. №1412)' : ' Законодательство Республики Таджикистан о выборах депутатов в местные Маджлисы народных депутатов основывается на Конституции Республики Таджикистан и состоит из настоящего конституционного Закона, других нормативных правовых актов Республики Таджикистан, а также международных правовых актов, признанных Таджикистаном. (КЗРТ от 26.07.14 г., № 1087)'}
                    </Text>
                    <Text style={styles.listItem}>
                        {language === 'Тоҷики' ? 'Моддаи 2. Ҳуқуқи умумии интихобот' : 'Статья 2. Всеобщее избирательное право'}
                    </Text>
                    <Text style={styles.textItem}>
                        {language === 'Тоҷики' ? ' Интихоботи вакилон ба Маҷлисҳои вакилони халқи Вилояти Мухтори Кӯҳистони Бадахшон, вилоят, шаҳри Душанбе, шаҳр ва ноҳия умумӣ аст. Шаҳрвандони Ҷумҳурии Тоҷикистон, ки дар рӯзи интихобот синнашон ба 18 расидааст, қатъи назар аз миллат, нажод, ҷинс, забон, эътиқоди динӣ, мавқеи сиёсӣ, вазъи иҷтимоӣ, таҳсил ва молу мулк ҳуқуқи интихоб кардан ва интихоб шуданро доранд. \n Шахсоне, ки аз тарафи суд ғайри қобили амал дониста шудаанд ва ё мувофиқи ҳукми суд дар ҷойҳои аз озодӣ маҳрумшудагон нигоҳ дошта мешаванд, ҳуқуқи дар интихобот иштирок кардан надоранд. \n Шаҳрванди Ҷумҳурии Тоҷикистон дар як вақт вакили беш аз ду мақомоти намояндагии ҳокимияти давлатӣ буда наметавонад. (ҚКҶТ аз 26.07.14 с., № 1087)' : ' Выборы депутатов в Маджлисы народных депутатов Горно-Бадахшанской автономной области, областей, города Душанбе, городов и районов являются всеобщими. Граждане Республики Таджикистан, достигшие ко дню выборов 18-летнего возраста, имеют право избирать и быть избранными, независимо от национальности, расы, пола, языка, вероисповедания и политических позиций, социального положения, образования и имущества. \n Не имеют права участвовать в выборах лица, признанные судом недееспособными либо содержащиеся в местах лишения свободы по приговору суда. \n Гражданин Республики Таджикистан не может быть одновременно депутатом более чем в двух представительных органах государственной власти. (КЗРТ от 26.07.14 г., № 1087)'}
                    </Text>
                    <Text style={styles.listItem}>
                        {language === 'Тоҷики' ? 'Моддаи 3. Ҳуқуқи баробари интихобот' : 'Статья 3. Равное избирательное право'}
                    </Text>
                    <Text style={styles.textItem}>
                        {language === 'Тоҷики' ? ' Интихобкунандагон дар асоси ҳуқуқи баробар дар интихобот иштирок мекунанд ва ҳар кадоми онҳо як овоз доранд. (ҚКҶТ аз 26.07.14 с., № 1087)' : ' Избиратели участвуют в выборах на равной правовой основе и каждый из них имеет один голос. (КЗРТ от 26.07.14 г., № 1087)'}
                    </Text>
                    <Text style={styles.listItem}>
                        {language === 'Тоҷики' ? 'Моддаи 4. Ҳуқуқи бевоситаи интихобот' : 'Статья 4. Прямое избирательное право'}
                    </Text>
                    <Text style={styles.textItem}>
                        {language === 'Тоҷики' ? ' Вакилон ба Маҷлисҳои маҳаллии вакилони халқ аз тарафи шаҳрвандон мустақиман интихоб карда мешаванд.' : ' Депутаты местных Маджлисов народных депутатов избираются гражданами непосредственно.'}
                    </Text>
                    <Text style={styles.listItem}>
                        {language === 'Тоҷики' ? 'Моддаи 5. Овоздиҳии пинҳонӣ' : 'Статья 5. Тайное голосование'}
                    </Text>
                    <Text style={styles.textItem}>
                        {language === 'Тоҷики' ? ' Овоздиҳӣ дар интихоботи вакилон ба Маҷлисҳои маҳаллии вакилони халқ озодона ва пинҳонӣ мебошад. Назорат ба изҳори иродаи интихобкунандагон манъ аст.' : ' Голосование на выборах депутатов в местные Маджлисы народных депутатов является свободным и тайным. Контроль за волеизъявлением голосующих не допускается.'}
                    </Text>
                    <Text style={styles.listItem}>
                        {language === 'Тоҷики' ? 'Моддаи 6. Ошкорбаёнӣ ҳангоми тайёрӣ ва гузаронидани интихобот' : 'Статья 6. Гласность при подготовке и проведении выборов'}
                    </Text>
                    <Text style={styles.textItem}>
                        {language === 'Тоҷики' ? ' Таёйрӣ ва гузаронидани интихобот ба Маҷлисҳои маҳаллии вакилони халқ аз тарафи комиссияҳои интихобот ошкоро сурат мегирад ва дар воситаҳои ахбори омма инъикос мегардад. \n Комиссияҳои интихобот ба шаҳрвандон аз кори худ, аз таъсиси ҳавзаҳо ва участкаҳои интихобот, ҳайат, ҷою соати корашон ва аз рӯйхати интихобкунандагон хабар медиҳанд. \n Комиссияҳои интихобот натиҷаи бақайдгирии номзадҳоро ба вакилӣ, шарҳи ҳоли номзадҳои бақайдгирифта, натиҷаи овозҳои гирифтаи ҳар номзад ва ҷамъбасти интихоботро ба маълумоти шаҳрвандон мерасонанд. Дар маҷлисҳои комиссияҳои интихобот, дар бинои овоздиҳӣ дар рӯзи интихобот ва ҳангоми ҳисобкунии овозҳо як нафари намоянда (нозир) аз ҳизбҳои сиёсӣ, ки номзадҳоро ба вакилӣ пешниҳод кардаанд, шахсони боэътимоди номзадҳои мустақил, намояндаҳои матбуот, телевизион ва радио ҳузур дошта метавонанд. Ваколатҳои онҳо бояд бо ҳуҷҷатҳои дахлдор тасдиқ карда шуда бошанд. \n Ҳизбҳои сиёсӣ, ки номзадҳоро ба вакилӣ пешбарӣ кардаанд, дар бораи намояндагони худ камаш панҷ рӯз пеш аз интихобот ба комиссияҳои ҳавзавии интихобот хабар медиҳанд. \n Ба рафти овоздиҳӣ ва ба фаъолияти комиссияҳои интихобот дахолат кардани намояндагон ва нозирон мумкин нест. Онҳо метавонанд бо иҷозати раиси комиссияи дахлдори интихобот савол диҳанд ва шарҳи онро талаб намоянд, диққати аъзоёни комиссия ва ҳозиронро ба роҳ ёфтани вайронкунии Қонуни конститутсионии мазкур ҷалб созанд. \n Воситаҳои ахбори омма рафти тайёрии интихобот ва гузаронидани он, инчунин қарорҳои комиссияҳои интихоботиро инъикос мекунанд. (ҚКҶТ аз 26.07.14 с., № 1087)' : ' Подготовка и проведение выборов в местные Маджлисы народных депутатов осуществляются избирательными комиссиями открыто и гласно и освещается в средствах массовой информации. \n Избирательные комиссии информируют граждан о своей работе, об образовании избирательных округов и участков, составе, местонахождении и времени работы избирательных комиссий и списках избирателей. \n Избирательные комиссии доводят до сведения граждан итоги регистрации кандидатов в депутаты, биографические данные о зарегистрированных кандидатах в депутаты, результаты голосования по каждому кандидату и итоги выборов. На заседаниях избирательной комиссии, в помещении для голосования в день выборов и при подсчете голосов имеют право присутствовать по одному представителю (наблюдателю) от политических партий, выдвинувших кандидатов в депутаты, доверенные лица самовыдвинутых кандидатов, представители печати, телевидения и радио. Их полномочия должны быть подтверждены соответствующими документами. \n Политические партии, выдвинувшие кандидатов в депутаты, заявляют в окружные избирательные комиссии о своих представителях не менее чем за пять дней до выборов. \n Вмешательство представителей и наблюдателей в процесс голосования и деятельность избирательных комиссий запрещается. Они вправе с разрешения председателя соответствующей избирательной комиссии ставить вопросы и требовать их пояснения, обращать внимание членов комиссии и присутствующих на допущенные нарушения настоящего конституционного Закона. \n Средства массовой информации освещают ход подготовки и проведения выборов, а также решения избирательных комиссий. (КЗРТ от 26.07.14 г., № 1087)'}
                    </Text>
                </View>
            </ScrollView>
        </View>
    );
};

const styles = StyleSheet.create({
    webcontainer:{
        height: '100vh',
        overflow: 'scroll',
        paddingBottom: "20px",
        overflowX: "hidden",
      },
    container: {
        flex: 1,
    },
    backgroundImage: {
        position: 'absolute',
        top: '30%',
        width: '150%',
        left: -50,
        height: '40%',
        opacity: 0.4,
    },
    overlay: {
        ...StyleSheet.absoluteFillObject,
        backgroundColor: 'rgba(255, 255, 255, 0.5)',
    },
    scrollContent: {
        paddingHorizontal: 20,
        paddingTop: 20,
    },
    listContainer: {
        alignItems: 'flex-start',
    },
    listItem: {
        fontSize: 23.6,
        fontWeight: 'bold',
        color: '#000',
        marginBottom: 15,
    },
    textItem: {
        fontSize: 22,
        marginBottom: 15,
    },
});

export default Section2Page2;