import React from 'react';
import { Platform, View, Text, StyleSheet, Image, ScrollView } from 'react-native';
import { useLanguage } from '../LanguageContext';

const Section3Page4 = () => {
const { language } = useLanguage();

return(
  <View style={Platform.OS === 'web' ? styles.webcontainer : styles.container}>
    <Image
      source={require('../images/parcham.png')}
      style={styles.backgroundImage}
      resizeMode="contain"
    />
    <View style={styles.overlay} />

    <ScrollView contentContainerStyle={styles.scrollContent}>
      <View style={styles.listContainer}>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 25. Асосҳои иқтисодии фаъолияти мақомоти худидоракунии шаҳрак ва деҳот' : 'Статья 25. Экономические основы деятельности органов самоуправления посёлков и сёл'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? ' Асосҳои иқтисодии фаъолияти мақомоти худидоракунии шаҳрак ва деҳотро молу мулки шаҳрак ва деҳот ва дигар молу мулке, ки ба он барои истифодабарӣ дода шудааст, ташкил медиҳанд. (ҚҶТ аз 30.05.17с., №1431) \n Вазъи ҳуқуқии молу мулки мақомоти худидоракунии шаҳрак ва деҳот тибқи талаботи қонунгузории Ҷумҳурии Тоҷикистон муайян ва танзим карда мешавад. (ҚҶТ аз 30.05.17с., №1431)' : ' Экономическую основу деятельности органов самоуправления посёлков и сёл составляет собственность посёлков и сёл и другое имущество, переданное в их пользование. (ЗРТ от 30.05.17 г., №1431) \n Правовой статус имущества органов самоуправления посёлков и сёл определяется и регулируется в соответствии с требованиями законодательства Республики Таджикистан. (ЗРТ от 30.05.17 г., №1431)'} 
        </Text>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 26. Манбаҳои молиявии шаҳрак ва деҳот' : 'Статья 26. Финансовые источники посёлков и сёл'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? ' Манбаҳои молиявии шаҳрак ва деҳот аз инҳо иборатанд: \n 1) маблағҳои буҷети шаҳрак ва деҳот; \n 2) маблағҳои мақсаднок аз ҳисоби буҷети ҷумҳуриявӣ дар шакли кўмаки молиявии беподош (дотатсия); \n 3) мусоидати молиявӣ (субвенсия); \n 4) маблағҳои хайрия; \n 5) даромад аз хизматрасонии пулакӣ мутобиқи санадҳои меъёрии ҳуқуқӣ; \n 6) даромад аз иҷрои ваколатҳои алоҳидаи вогузоршудаи давлатие, ки мақомоти худидоракунии шаҳрак ва деҳот анҷом медиҳад; \n 7) даромад аз молу мулки шаҳрак ва деҳот; \n 8) даромад аз грантҳо ва сармоягузориҳо; \n 9) дигар манбаҳое, ки санадҳои меъёрии ҳуқуқии Ҷумҳурии Тоҷикистон манъ накардааст. \n Манбаъҳои молиявии шаҳрак ва деҳот тибқи талаботи санадҳои меъёрии ҳуқуқии Ҷумҳурии Тоҷикистон ташкил карда мешаванд. (ҚҶТ аз 16.04.12с., №827)' : ' Финансовые источники посёлков и сёл состоят из: \n 1) бюджетных средств посёлков и сёл; \n 2) целевых средств из средств республиканского бюджета в форме безвозмездной финансовой помощи (дотации); \n 3) финансового содействия (субвенции); \n 4) добровольных взносов; \n 5) дохода от оказания платных услуг в соответствии с нормативными правовыми актами; \n 6) дохода от исполнения отдельных возложенных государственных полномочий, осуществляемых органами самоуправления посёлков и сёл; \n 7) дохода от имущества собственности посёлков и сёл; \n 8) дохода от грантов и инвестиций; \n 9( других источников, не запрещенных нормативными правовыми актами. \n Финансовые источники поселков и сел формируются в соответствии с требованиями нормативных правовых актов Республики Таджикистан. (ЗРТ от 16.04.12г., №827)'}
        </Text>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 27. Буҷети шаҳрак ва деҳот (ҚҶТ аз 30.05.17с., №1431)' : 'Статья 27. Бюджет посёлков и сёл (ЗРТ от 30.05.17 г., №1431)'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? ' Лоиҳаи буҷети шаҳрак ва деҳот аз рӯи манбаъҳои даромад ва самтҳои хароҷот бо тартиби муқаррарнамудаи санадҳои меъёрии ҳуқуқии Ҷумҳурии Тоҷикистон таҳия гардида, аз ҷониби Ҷамоат баррасӣ ва дар шакли қарор қабул карда мешавад. (ҚҶТ аз 30.05.17с., №1431) \n Қисми даромади буҷети шаҳрак ва деҳот аз ҳисоби даромадҳои андозӣ ва ғайриандозӣ ташаккул дода мешавад. (ҚҶТ аз 30.05.17с., №1431) \n Ба даромади буҷети шаҳрак ва деҳот маблағҳо аз ҳисоби андозҳо аз молу мулки ғайриманқули шахсони воқеӣ дохил мешаванд. (ҚҶТ аз 30.05.17с., №1431) \n Даромадҳои ғайриандозӣ аз мусоидати молиявӣ (субвенсия), пардохтҳои ихтиёрӣ, даромадҳои хизматрасонии пулакӣ ва даромадҳо аз ҳисоби амалисозии ваколатҳои алоҳидаи давлатӣ, ки ба зиммаи мақомоти худидоракунии шаҳрак ва деҳот вогузор шудаанд, инчунин аз дигар манбаъҳое, ки санадҳои меъёрии ҳуқуқӣ манъ накардаанд, иборат мебошанд. (ҚҶТ аз 30.05.17с., №1431) \n Хароҷоти буҷети шаҳрак ва деҳот бо мақсади рушди вазъи иқтисодӣ, иҷтимоӣ ва фарҳангии шаҳрак ва деҳот аз ҷониби Ҷамоат амалӣ карда мешавад. (ҚҶТ аз 30.05.17с., №1431) \n Ба буҷети шаҳрак ва деҳот бо тартиби муқаррарнамудаи қонунгузории Ҷумҳурии Тоҷикистон бо қарори Ҷамоат тағйиру иловаҳо ворид карда мешаванд. (ҚҶТ аз 30.05.17с., №1431)' : ' Проект бюджета посёлков и сёл по источникам дохода и расходным частям разрабатывается, рассматривается и принимается в форме решения Джамоатом в порядке, установленном нормативными правовыми актами Республики Таджикистан. (ЗРТ от 30.05.17 г., №1431) \n Часть дохода бюджета посёлков и сёл формируется за счет налоговых и неналоговых доходов. (ЗРТ от 30.05.17 г., №1431) \n В доходы бюджета посёлков и сёл входят платежи за счет налога от недвижимого имущества физических лиц. (ЗРТ от 30.05.17 г., №1431) \n Неналоговые доходы состоят из субвенций, добровольных платежей, доходов от платных услуг и доходов за счет осуществления возложенных отдельных государственных полномочий органами самоуправления посёлков и сёл, а также другие источники, не запрещенные нормативными правовыми актами. (ЗРТ от 30.05.17 г., №1431) \n Расход бюджета посёлков и сёл осуществляется с целью развития экономического, социального и культурного состояния посёлков и сёл Джамоатом. (ЗРТ от 30.05.17 г., №1431) \n Изменения и дополнения в бюджет посёлков и сёл вносятся в соответствии с требованиями законодательства Республики Таджикистан решением Джамоата. (ЗРТ от 30.05.17 г., №1431)'}
        </Text>
      </View>
    </ScrollView>
  </View>
  );
};

const styles = StyleSheet.create({
  webcontainer:{
    height: '100vh',
    overflow: 'scroll',
    paddingBottom: "20px",
    overflowX: "hidden",
  },
  container: {
    flex: 1,
  },
  backgroundImage: {
    position: 'absolute',
    top: '30%',
    width: '150%',
    left: -50,
    height: '40%',
    opacity: 0.3,
  },
  overlay: {
    ...StyleSheet.absoluteFillObject,
    backgroundColor: 'rgba(255, 255, 255, 0.5)',
  },
  scrollContent: {
    paddingHorizontal: 20,
    paddingTop: 20,
  },
  listContainer: {
    alignItems: 'flex-start',
  },
  listItem: {
    fontSize: 23.6,
    fontWeight: 'bold',
    color: '#000',
    marginBottom: 15,
  },
  textItem: {
    fontSize: 22,
    marginBottom: 15,
  },
});

export default Section3Page4;