import React from 'react';
import { Platform, View, Text, StyleSheet, Image, ScrollView } from 'react-native';
import { useLanguage } from '../LanguageContext';

const Section1Page4 = () => {
const { language } = useLanguage();

return(
  <View style={Platform.OS === 'web' ? styles.webcontainer : styles.container}>
    <Image
      source={require('../images/parcham.png')}
      style={styles.backgroundImage}
      resizeMode="contain"
    />
    <View style={styles.overlay} />

    <ScrollView contentContainerStyle={styles.scrollContent}>
      <View style={styles.listContainer}>
        <Text style={styles.listItem}>
        {language === 'Тоҷики' ? 'Моддаи 21. Ташкили ҳавзаҳои интихобот' : 'Статья 21. Образование избирательных округов'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? ' Барои интихоботи аъзои Маҷлиси миллӣ ва вакилони Маҷлиси намояндагон ҳавзаҳои ҳудудии интихобот ташкил карда мешаванд. Дар тамоми ҳудуди Ҷумҳурии Тоҷикистон барои интихоботи аъзои Маҷлиси миллӣ панҷ ҳавзаи интихоботи бисёрмандатӣ, аз ҷумла якҳавзагӣ дар Вилояти Мухтори Кӯҳистони Бадахшон, вилоятҳо, шаҳри Душанбе ва дар шаҳру ноҳияҳои тобеи Ҷумҳурии Тоҷикистон дар якҷоягӣ як ҳавза ташкил карда мешаванд. Қароргоҳи комиссияҳои ҳавзавии интихобот оид ба интихоботи аъзоёни Маҷлиси миллӣ дар Вилояти Мухтори Кӯҳистони Бадахшон ва вилоятҳо мувофиқан марказҳои вилоятҳо – шаҳрҳои Хоруғ, Хуҷанд ва шаҳри Қӯрғонтеппа, барои шаҳри Душанбе ва шаҳру ноҳияҳои тобеи ҷумҳурӣ - шаҳри Душанбе ба ҳисоб мераванд. Барои интихоботи вакилони Маҷлиси намояндагон 41 ҳавзаи ҳудудии якмандатӣ ва барои интихоботи вакилони Маҷлиси намояндагон, ки рӯйхаташон аз тарафи ҳизбҳои сиёсӣ пешбарӣ шудааст, як ҳавзаи ягонаи умумиҷумҳуриявӣ ташкил карда мешаванд. Меъёри шумораи интихобкунандагони ҳавзаи интихобот оид ба интихоботи вакилони Маҷлиси намояндагон аз ҷониби Комиссияи марказии интихобот ва раъйпурсӣ барои ҳар як интихобот бо роҳи тақсими шумораи умумии интихобкунандагони Ҷумҳурии Тоҷикистон ба шумораи ҳавзаҳои ташкилёбандаи ҳудудии якмандата муайян карда мешавад. Ҳавзаҳои интихоботро Комиссияи марказии интихобот ва раъйпурсӣ таъсис медиҳад. Ҳангоми ташкил намудани ҳавзаҳои интихобот талаботи зерин дар назар дошта мешавад: \n 1) шумораи тақрибан баробари интихобкунандагон дар ҳавзаҳои интихобот бо 15 фоиз каму зиёдии шумораи интихобкунандагон, дар ноҳияҳои дурдаст бошад, то 20 фоиз иҷозат дода мешавад; \n 2) ҳавзаҳои интихобот ҳудуди ягонаро дар ҳудуди Вилояти Мухтори Кӯҳистони Бадахшон, вилоятҳо, шаҳри Душанбе, шаҳру ноҳияҳои тобеи ҷумҳурӣ ташкил медиҳанд. Ташкили ҳавзаҳои интихобот аз ҳисоби маҳалҳои ба ҳам ҳамҳудуд набуда мумкин нест. \n Дар сурати риояи талаботи дар бандҳои 1, 2 зикршудаи ин модда, чун қоида тақсимоти маъмурию ҳудудии Ҷумҳурии Тоҷикистон ба назар гирифта мешавад. Комиссияи марказии интихобот ва раъйпурсӣ рӯйхати ҳавзаҳои интихоботро бо зикри ҳудуд ва шумораи интихобкунандагони онҳо ва қароргоҳи комиссияҳои ҳавзавии интихобот баъд аз панҷ рӯзи таъини интихобот чоп мекунад.' : 'Для выборов членов Маджлиси милли и депутатов Маджлиси намояндагон образуются территориальные избирательные округа. Для выборов членов Маджлиси милли на всей территории Республики Таджикистан создается пять многомандатных избирательных округов, в том числе по одному округу в Горно-Бадахшанской автономной области, областях, городе Душанбе и один объединенный округ в городах и районах республиканского подчинения. Местонахождением окружных избирательных комиссий по выборам членов Маджлиси милли в Горно-Бадахшанской автономной области и областях соответственно являются областные центры – города Хорог, Худжанд и Курган-Тюбе, для города Душанбе и городов, районов республиканского подчинения – город Душанбе. Для выборов депутатов Маджлиси намояндагон создается 41 одномандатный территориальный округ и для выборов депутатов Маджлиси намояндагон, список которых представлен политическими партиями, один единый общереспубликанский округ. Нормы количества избирателей избирательного участка по выборам депутатов Маджлиси намояндагон определяются Центральной комиссией по выборам и референдумам для каждых выборов путем деления общего количества избирателей Республики Таджикистан на количество одномандатных округов, создающихся на территории. Избирательные округа учреждает Центральная комиссия по выборам и референдумам. При образовании избирательных округов должны соблюдаться следующие требования: \n 1) примерное равенство избирательных округов по числу избирателей с допустимым отклонением не более чем на 15 процентов от общего числа избирателей, а в отдаленных районах – на 20 процентов; \n 2) избирательные округа составляют единую территорию в пределах Горно – Бадахшанской автономной области, областей, города Душанбе, городов и районов республиканского подчинения. Не допускается образование избирательного округа за счет не граничащих между собой территорий. \n В случае соблюдения пунктов 1, 2 данной статьи, как правило, учитывается административно – территориальное деление Республики Таджикистан. Центральная комиссия по выборам и референдумам публикует списки избирательных округов с указанием их границ, численного состава их избирателей и местонахождения окружных избирательных комиссий по истечении пяти дней со дня назначения выборов.'}
        </Text>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 22. Тартиб ва меъёри ташкили участкаҳои интихобот' : 'Статья 22. Порядок и норма образования избирательных участков'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? ' Ба мақсади фароҳам овардани шароити муносиб барои интихобкунандагон ҳудуди шаҳр, ноҳия, ноҳияҳои тобеи шаҳрҳоро ба назар гирифта, участкаҳои интихобот ташкил карда мешаванд. Ҳудуди участкаи интихобот набояд аз ҳудуди ҳавзаи интихобот берун бошад. Участкаҳои интихобот дар назди намояндагии Ҷумҳурии Тоҷикистон, ки дар давлатҳои хориҷӣ воқеанд, дар санатория, хонаҳои истироҳат, беморхонаҳо ва муассисаҳои дигари доимии муолиҷавӣ, дар ҷойи буду боши шаҳрвандон, дар маҳалҳои дурдасту душворгузар, дар маҳалҳое, ки мутобиқи ҷойи воқеъгаштаашон ба ҳавзаҳои интихоботӣ дохиланд, ташкил шуда метавонанд. Масъалаи ба ҳавзаи интихобот вобаста кардани участкаҳои интихоботро, ки берун аз ҳудуди Ҷумҳурии Тоҷикистон ташкил шудаанд, Комиссияи марказии интихобот ва раъйпурсӣ ҳал мекунад. Участкаҳои интихобот аз тарафи комиссияҳои ҳавзавии интихобот бо пешниҳоди раисони шаҳрҳо, ноҳияҳо ташкил карда мешаванд. Участкаҳои интихобот дар давоми бисту панҷ рӯзи баъди таъини интихобот ташкил карда мешаванд. Дар намояндагиҳои Ҷумҳурии Тоҷикистон, ки дар давлатҳои хориҷӣ воқеанд, инчунин дар маҳалҳои дурдаст ва душворгузар участкаҳои интихобот дар муҳлати мазкур ва дар ҳолатҳои истисноӣ камаш даҳ рӯз пеш аз интихобот ташкил карда мешаванд. Участкаҳои интихобот дар маҳалҳое, ки на камтар аз 20 нафар ва на зиёдтар аз 3000 нафар интихобкунандагон доранд, ташкил карда мешаванд. Раиси шаҳр, ноҳия дар асоси пешниҳоди комиссияи ҳавзавии интихобот оид ба ташкили участкаҳои интихобот дар муддати се рӯз ҳар як участкаи интихоботро барои гузаронидани интихобот ройгон бо бино таъмин менамояд. Комиссияи ҳавзавии интихобот интихобкунандагонро аз ҳудуди ҳар участкаи интихобот хабардор карда, қароргоҳи комиссияи участкаи интихобот ва бинои овоздиҳиро зикр мекунад.' : 'Избирательные участки образуются с учетом территорий районов, городов, районов в городах с целью создания максимальных удобств для избирателей. Территории избирательных участков не должны пересекать территории избирательных округов. Избирательные участки могут быть образованы при представительствах Республики Таджикистан в иностранных государствах, в санаториях, домах отдыха, в больницах и других стационарных лечебных учреждениях, в местах нахождения граждан, расположенных в отдаленных и труднодоступных населенных пунктах, которые входят в избирательные округа соответственно по месту их нахождения. Вопрос о приписке к избирательному округу избирательных участков, образуемых за пределами Таджикистана, решается Центральной комиссией по выборам и референдумам. Избирательные участки образуются окружными избирательными комиссиями по представлению председателей городов, районов. Избирательные участки образуются в течение двадцати пяти дней после назначения выборов. При представительствах Республики Таджикистан в иностранных государствах, а также в отдаленных и труднодоступных населенных пунктах избирательные участки образуются в тот же срок, а в исключительных случаях – не позднее чем за десять дней до выборов. Избирательные участки образуются в местностях с числом не менее 20 и не более 3000 избирателей. Председатели города, района на основе представления окружной избирательной комиссии по организации избирательных участков в течение трех дней должны обеспечить каждый участок помещением для проведения выборов безвозмездно. Окружная избирательная комиссия организует оповещение избирателей о границах каждого избирательного участка с указанием местонахождения участковой избирательной комиссии и помещения для голосования.'}
        </Text>
      </View>
    </ScrollView>
  </View>
  );
};

const styles = StyleSheet.create({
  webcontainer:{
    height: '100vh',
    overflow: 'scroll',
    paddingBottom: "70px",
    overflowX: "hidden",
  },
  container: {
    flex: 1,
  },
  backgroundImage: {
    position: 'absolute',
    top: '30%',
    width: '150%',
    left: -50,
    height: '40%',
    opacity: 0.4,
  },
  overlay: {
    ...StyleSheet.absoluteFillObject,
    backgroundColor: 'rgba(255, 255, 255, 0.5)',
  },
  scrollContent: {
    paddingHorizontal: 20,
    paddingTop: 20,
  },
  listContainer: {
    alignItems: 'flex-start',
  },
  listItem: {
    fontSize: 23,
    fontWeight: 'bold',
    color: '#000',
    marginBottom: 15,
  },
  textItem: {
    fontSize: 20,
    marginBottom: 15,
  },
});

export default Section1Page4;