import React from 'react';
import { Platform, View, Text, StyleSheet, Image, ScrollView } from 'react-native';
import { useLanguage } from '../LanguageContext';

const Section3Page2 = () => {
const { language } = useLanguage();

return(
  <View style={Platform.OS === 'web' ? styles.webcontainer : styles.container}>
    <Image
      source={require('../images/parcham.png')}
      style={styles.backgroundImage}
      resizeMode="contain"
    />
    <View style={styles.overlay} />

    <ScrollView contentContainerStyle={styles.scrollContent}>
      <View style={styles.listContainer}>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 1. Мафҳумҳои асосӣ' : 'Статья 1. Основные понятия'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? ' Мафҳумҳои асосие, ки дар Қонуни мазкур истифода мешаванд: \n 1) шаҳрак ва деҳот – воҳиди маъмурию ҳудудӣ мебошад, ки дар ҳудуди он худидоракунӣ бевосита ва ё ба воситаи мақомоти худидоракунии шаҳрак ва деҳот амалӣ мешавад; (ҚҶТ аз 30.05.17с., №1431) \n 2) худидоракунии шаҳрак ва деҳот - фаъолияти аҳолии шаҳрак ва деҳот мебошад, ки бевосита ё ба воситаи мақомоти худидоракунии шаҳрак ва деҳот таҳти масъулияти худ барои ҳал намудани масъалаҳои иҷтимоӣ, иқтисодӣ ва фарҳангии аҳамияти маҳаллидошта, бо назардошти манфиатҳои умумиҷамъиятӣ, анъанаҳои миллӣ ва хусусиятҳои маҳаллӣ, амалӣ мегардад; \n 3) мақомоти худидоракунии шаҳрак ва деҳот – ҷамоат (Ҷамоати шаҳрак ва Ҷамоати деҳот) мебошад, ки аз ҷониби интихобкунандагони шаҳрак ва деҳот интихоб шуда, масъалаҳои дорои аҳамияти маҳаллиро дар доираи ваколатҳои худ ҳал мекунад; (ҚҶТ аз 16.04.12с., №827; (ҚҶТ аз 30.05.17с., №1431) \n 4) маҷлиси Ҷамоат – шакли асосии фаъолияти Ҷамоат буда, дар он масъалаҳои ваколати Ҷамоат баррасӣ мешаванд; (ҚҶТ аз 30.05.17с., №1431) \n 5) Шўрои Ҷамоат – мақомоти коллегиалии Ҷамоат буда, ваколатҳои пешбининамудаи Қонуни мазкурро амалӣ менамояд; \n 6) раиси Ҷамоат – роҳбари мақомоти худидоракунии шаҳрак ва деҳот буда, аз тарафи вакилони Ҷамоат интихоб мешавад; \n 7) вакили Ҷамоат – шаҳрванде, ки бо тартиби муқарраркардаи Қонуни мазкур ба Ҷамоат интихоб шудааст; \n 8) масъалаҳои дорои аҳамияти маҳаллӣ – масъалаҳои ҳамарўзаи аҳолии шаҳрак ва деҳот, ки барои ҳалли онҳо Ҷамоат масъулияти пурра дошта, онҳоро дар доираи стандартҳои давлатӣ, мутобиқи санадҳои меъёрии ҳуқуқӣ ва бо истифодаи маблағҳои худӣ мустақилона амалӣ менамояд; \n 9) ваколати вогузоршаванда – ваколати мақомоти маҳаллии ҳокимияти давлатӣ, ки мутобиқи санадҳои меъёрии ҳуқуқӣ ва ё дар асоси шартномаи тарафҳо ба ихтиёри Ҷамоат, инчунин ваколати Ҷамоат, ки дар асоси шартнома ба мақомоти худфаъолияти ҷамъиятӣ вогузошта мешавад; \n 10) ваколати истисноӣ – ваколате, ки мутобиқи Қонуни мазкур ва дигар санадҳои меъёрии ҳуқуқӣ ба мақомоти худидоракунии шаҳрак ва деҳот тааллуқ дорад ва барои иҷрои он танҳо ин мақомот масъул мебошад.' : ' Основные понятия, используемые в настоящем Законе: \n 1) посёлки и сёла – административно-территориальные единицы, на территории которых осуществляется самоуправление непосредственно или через органы самоуправления посёлков и сёл; \n 2) самоуправление посёлков и сёл – деятельность населения посёлков и сёл, непосредственно или через органы самоуправления посёлков и сёл под свою ответственность в целях решения социальных, экономических и культурных вопросов, имеющих местное значение, с учетом общесоциальных интересов, национальных традиций и местной специфики; \n 3) органы самоуправления посёлков и сёл – Джамоат (Джамоат посёлка и Джамоат села), который избирается избирателями посёлков и сёл и решает вопросы местного значения в пределах своих полномочий; (ЗРТ от 30.05.17 г., №1431) \n 4) собрание Джамоата - основная форма деятельности Джамоата, на котором решаются вопросы полномочий Джамоата; (ЗРТ от 16.04.12г., №827; (ЗРТ от 30.05.17 г., №1431) \n 5) совет Джамоата - коллегиальный орган Джамоата, который осуществляет полномочия, предусмотренные настоящим Законом; \n 6) председатель Джамоата – глава органа самоуправления посёлков и сёл, который избирается депутатами Джамоата; \n 7) депутат Джамоата – гражданин, который избирается в Джамоат в порядке, установленном настоящим Законом; \n 8) вопросы местного значения – повседневные вопросы населения посёлка и села, за решение которых Джамоат несет полную ответственность и самостоятельно осуществляет их в пределах государственных стандартов в соответствии с нормативными правовыми актами, с использованием собственных средств; \n 9) возлагаемые полномочия – полномочия местных органов государственной власти, которые в соответствии с нормативными правовыми актами или на основе договора сторон переданы Джамоату, а также полномочия Джамоата, которые на основании договора возложены на общественные органы самоуправления; \n 10) исключительные полномочия – полномочия, которые в соответствии с настоящим Законом и другими нормативными правовыми актами относятся к органам самоуправления посёлков и сёл и за выполнение которых ответственен только данный орган.'}
        </Text>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 2. Қонунгузории Ҷумҳурии Тоҷикистон дар бораи мақомоти худидоракунии шаҳрак ва деҳот' : 'Статья 2. Законодательство Республики Таджикистан об органах самоуправления посёлков и сёл'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? ' Қонунгузории Ҷумҳурии Тоҷикистон дар бораи мақомоти худидоракунии шаҳрак ва деҳот ба Конститутсияи Ҷумҳурии Тоҷикистон асос ёфта, аз Қонуни мазкур, дигар санадҳои меъёрии ҳуқуқии Ҷумҳурии Тоҷикистон, санадҳои ҳуқуқии байналмилалие, ки Ҷумҳурии Тоҷикистон, инчунин онҳоро эътироф намудааст, иборат мебошад. (ҚҶТ аз 30.05.17с., №1431)' : ' Законодательство Республики Таджикистан об органах самоуправления посёлков и сёл основывается на Конституции Республики Таджикистан и состоит из настоящего Закона, других нормативных правовых актов Республики Таджикистан, а также международных правовых актов, признанных Республикой Таджикистан.'}
        </Text>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 3. Мақомоти худидоракунии шаҳрак ва деҳот' : 'Статья 3. Органы самоуправления посёлков и сёл'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? ' Мақомоти худидоракунии шаҳрак ва деҳот Ҷамоат аст. \n Ҷамоат шахси ҳуқуқӣ буда, дорои мўҳри мудаввар мебошад, ки дар он Нишони давлатии Ҷумҳурии Тоҷикистон ва номи пурраи Ҷамоат тасвир меёбад. \n Танзими ҳуқуқии фаъолияти Ҷамоат мутобиқи санадҳои меъёрии ҳуқуқӣ дар бораи мақомоти давлатӣ сурат мегирад.' : 'Органом самоуправления посёлков и сёл является Джамоат. \n Джамоат является юридическим лицом и имеет круглую печать, на которой изображены Государственный герб Республики Таджикистан и полное название Джамоата. \n Правовое регулирование деятельности Джамоата осуществляется в соответствии с нормативными правовыми актами о государственных органах.'}
        </Text>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 4. Иштироки шаҳрвандон дар худидоракунии шаҳрак ва деҳот' : 'Статья 4. Участие населения в самоуправлении посёлков и сёл'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? ' Шаҳрвандони Ҷумҳурии Тоҷикистон, ки синнашон ба 18 расидааст ва дар ҳудуди шаҳрак ва деҳот истиқомат мекунанд, ҳуқуқ доранд дар ташкил ва фаъолияти мақомоти худидоракунии шаҳрак ва деҳот иштирок намоянд. \n Ҳама гуна маҳдудкунии ҳуқуқи шаҳрвандони Ҷумҳурии Тоҷикистон, қатъи назар аз миллат, нажод, ҷинс, забон, эътиқоди динӣ, мавқеи сиёсӣ, вазъи иҷтимоӣ, таҳсилот ва молу мулк дар ташкил ва фаъолияти мақомоти худидоракунии шаҳрак ва деҳот, ба ғайр аз ҳолатҳое, ки дар Қонуни мазкур нишон дода шудаанд, манъ аст.' : ' Граждане Республики Таджикистан, достигшие 18-летнего возраста и проживающие на территории посёлка и села, имеют право участвовать в организации и деятельности органов самоуправления посёлка и села. \n Запрещается всякое ограничение прав граждан Республики Таджикистан в учреждении и деятельности органов самоуправления посёлков и сёл, независимо от их национальности, расовой принадлежности, пола, языка, вероисповедания, политической позиции, социального положения, образования и имущественного состояния, кроме случаев, указанных в настоящем Законе.'}
        </Text>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 5. Принсипҳои фаъолияти мақомоти худидоракунии шаҳрак ва деҳот' : 'Статья 5. Принципы деятельности органов самоуправления посёлков и сёл'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? ' Фаъолияти мақомоти худидоракунии шаҳрак ва деҳот ба принсипҳои зерин асос меёбад: \n 1) қонуният ва адолати иҷтимоӣ; \n 2) ҳифзи ҳуқуқу озодиҳои инсон ва шаҳрванд; \n 3) демократия, ошкорбаёнӣ ва ба эътибор гирифтани афкори омма; \n 4) мустақилият, худидоракунӣ ва масъулият дар ҳалли масъалаҳои аҳамияти маҳаллидошта; 5) ҳисоботдиҳанда будан дар назди аҳолӣ; \n 6) иштироки шаҳрвандон дар худидоракунии маҳаллӣ; \n 7) мутобиқати манфиатҳои маҳаллӣ ва умумидавлатӣ; \n 8) коллегиалӣ будани фаъолияти Ҷамоат.' : ' Деятельность органов самоуправления посёлков и сёл основывается на следующих принципах: 1) законность и социальная справедливость; 2) защита прав и свобод человека и гражданина; 3) демократия, гласность и учёт мнения населения; 4) самостоятельность, самоуправление и ответственность за решение проблем местного значения; 5) отчетность перед населением; 6) участие граждан в местном самоуправлении; 7) координация местных и общегосударственных интересов; 8) коллегиальность деятельности Джамоата.'}
        </Text>
        <Text style={styles.listItem}>
          {language === 'Тоҷики' ? 'Моддаи 6. Дастгирии давлатии мақомоти худидоракунии шаҳрак ва деҳот' : 'Статья 6. Государственная поддержка органов самоуправления посёлков и сёл'}
        </Text>
        <Text style={styles.textItem}>
          {language === 'Тоҷики' ? ' Мақомоти ҳокимияти давлатӣ дар ташкил, инкишоф ва фаъолияти самараноки мақомоти худидоракунии шаҳрак ва деҳот шароити зарурии ҳуқуқӣ, ташкилӣ, моддӣ, молиявӣ муҳайё намуда, барои амалишавии ҳуқуқи шаҳрвандон ба худидоракунии маҳаллӣ мусоидат мекунанд. (ҚҶТ аз 30.05.17с., №1431) \n Мақомоти ҳокимияти давлатӣ метавонанд татбиқи ваколатҳои алоҳидаи худро ба мақомоти худидоракунии шаҳрак ва деҳот дар асоси шартнома ва бо маблағгузории ин ваколатҳо вогузоранд. (ҚҶТ аз 16.04.12с., №827; (ҚҶТ аз 30.05.17с., №1431)' : ' Органы государственной власти создают необходимые правовые, организационные, материальные и финансовые условия для формирования, развития и эффективной деятельности органов самоуправления посёлков и сёл и способствуют реализации прав граждан на местное самоуправление. \n Местные органы государственной власти могут возложить отдельные свои полномочия на органы самоуправления посёлков и сёл на основе договора и финансирование этих полномочий. (ЗРТ от 16.04.12г., №827; (ЗРТ от 30.05.17 г., №1431)'}
        </Text>
        <Text style={styles.listItem}>
        {language === 'Тоҷики' ? 'Моддаи 7. Муносибати мақомоти худидоракунии шаҳрак ва деҳот бо мақомоти худфаъолияти ҷамъиятӣ' : 'Статья 7. Отношения органов самоуправления посёлков и сёл с органами общественной самодеятельности'}
        </Text>
        <Text style={styles.textItem}>
        {language === 'Тоҷики' ? ' Мақомоти худидоракунии шаҳрак ва деҳот бо мақомоти худфаъолияти ҷамъиятӣ ҳамкорӣ менамояд, барои амалӣ намудани вазифаҳои онҳо мусоидат намуда, онҳоро ба қайди баҳисобгирӣ мегирад ва метавонад татбиқи ваколатҳои алоҳидаи худро дар асоси шартнома ва бо маблағгузории ин ваколатҳо ба онҳо вогузорад.' : ' Органы самоуправления посёлков и сёл сотрудничают с органами общественной самодеятельности, содействуют выполнению ими своих задач, регистрируют их и могут возложить на них свои отдельные полномочия на основе договора и финансирование этих полномочий.'}
        </Text>
      </View>
    </ScrollView>
  </View>
  );
};

const styles = StyleSheet.create({
  webcontainer:{
    height: '100vh',
    overflow: 'scroll',
    paddingBottom: "20px",
    overflowX: "hidden",
  },
  container: {
    flex: 1,
  },
  backgroundImage: {
    position: 'absolute',
    top: '30%',
    width: '150%',
    left: -50,
    height: '40%',
    opacity: 0.4,
  },
  overlay: {
    ...StyleSheet.absoluteFillObject,
    backgroundColor: 'rgba(255, 255, 255, 0.5)',
  },
  scrollContent: {
    paddingHorizontal: 20,
    paddingTop: 20,
  },
  listContainer: {
    alignItems: 'flex-start',
  },
  listItem: {
    fontSize: 23.6,
    fontWeight: 'bold',
    color: '#000',
    marginBottom: 15,
  },
  textItem: {
    fontSize: 23,
    marginBottom: 15,
  },
});

export default Section3Page2;