import React from 'react';
import { Platform, View, Text, StyleSheet, Image, ScrollView } from 'react-native';
import { useLanguage } from '../LanguageContext';

const Section2Page7 = () => {
    const { language } = useLanguage();

    return (
        <View style={Platform.OS === 'web' ? styles.webcontainer : styles.container}>
            <Image
                source={require('../images/parcham.png')}
                style={styles.backgroundImage}
                resizeMode="contain"
            />
            <View style={styles.overlay} />

            <ScrollView contentContainerStyle={styles.scrollContent}>
                <View style={styles.listContainer}>
                    <Text style={styles.listItem}>
                        {language === 'Тоҷики' ? 'Моддаи 31. Ҳуқуқи номзад ба вакилӣ барои иштирок дар маъракаи пешазинтихоботӣ' : 'Статья 31. Право кандидата в депутаты участвовать в предвыборной кампании'}
                    </Text>
                    <Text style={styles.textItem}>
                        {language === 'Тоҷики' ? ' Номзадҳо ба вакилии Маҷлисҳои маҳаллӣ аз вақти пешбарӣ шудани онҳо дар маъракаи пешазинтихоботӣ дар асоси шартҳои баробар иштирок менамоянд. Номзадҳо ба вакилӣ ҳуқуқ доранд дар маҷлисҳою машваратҳои пешазинтихоботӣ ва дигар маҷлисҳо иштирок намоянд, тавассути матбуот, телевизион ва радио баромад кунанд. \n Мақомоти давлатию ҷамъиятӣ, роҳбарони ташкилотҳо ва мақомоти ташаббускори ҷамъятӣ вазифадоранд, ки барои ташкили вохӯриҳо бо интихобкунандагон, ба даст овардани маълумотномаю хабарномаҳо ба номзад ба вакилӣ кӯмак намоянд. (ҚКҶТ аз 26.07.14 с., № 1087)' : ' Кандидаты в депутаты местных Маджлисов народных депутатов с момента их выдвижения участвуют в предвыборной кампании на равных условиях. Кандидаты в депутаты имеют право выступать на предвыборных и иных собраниях, заседаниях, совещаниях, в печати, по телевидению и радио. \n Государственные и общественные органы, руководители организаций, органы общественного самоуправления населения обязаны оказывать кандидату в депутаты содействие в организации встреч с избирателями, в получении необходимых справочных материалов. (КЗРТ от 26.07.14 г., № 1087)'}
                    </Text>
                    <Text style={styles.listItem}>
                        {language === 'Тоҷики' ? 'Моддаи 32. Барномаи пешазинтихоботии номзад ба вакилӣ' : 'Статья 32. Предвыборная программа кандидата в депутаты'}
                    </Text>
                    <Text style={styles.textItem}>
                        {language === 'Тоҷики' ? ' Номзад ба вакилӣ метавонад бо барномаи фаъолияти ояндаи хеш баромад намояд. Барномаи номзад ба вакилӣ набояд мухолифи Конститутсия ва қонунҳои Ҷумҳурии Тоҷикистон бошад. Номзад ба вакилӣ дар сурати интихоб шуданаш дар назди интихоботкунандагон барои иҷрои барномаи пешазинтихоботияш масъул аст. (ҚКҶТ аз 26.07.14 с., № 1087), (ҚКҶТ аз 30.05.2017 с. №1412)' : ' Кандидат в депутаты может выступать с программой своей будущей деятельности. Программа кандидата в депутаты не должна противоречить Конституции и законам Республики Таджикистан. Кандидат в депутаты в случае его избрания ответственен перед избирателями за выполнение своей предвыборной программы.'}
                    </Text>
                    <Text style={styles.listItem}>
                        {language === 'Тоҷики' ? 'Моддаи 33. Шахсони боэътимоди номзад ба вакилӣ' : 'Статья 33. Доверенные лица кандидата в депутаты'}
                    </Text>
                    <Text style={styles.textItem}>
                        {language === 'Тоҷики' ? ' Номзад ба вакилии Маҷлиси вакилони халқи вилоят метавонад то се ва Маҷлиси вакилони халқи шаҳриву нохиявӣ то ду нафар шахси боэътимод дошта бошад, ки онҳо дар гузаронидани маъракаи интихоботӣ ба ӯ ёрӣ мерасонанд. Барои вакил интихоб шуданаш ташвиқот мебаранд, дар муносибат бо мақомоти давлатию ҷамъиятӣ, интихобкунандагон ва комиссияҳои интихоботӣ манфиатҳои ӯро ҳимоя менамоянд. \n Номзад ба вакилӣ шахсони боэътимодро ихтиёран муайян мекунад, дар бораи онҳо ба комиссияи ҳавзавии интихобот барои ба қайд гирифтанашон хабар медиҳад. Комиссияи интихобот баъди ба қайд гирифтани шахсони боэътимод ба онҳо шаходатнома медиҳад. Номзад ба вакилӣ хуқуқ дорад, ки шахсони боътимоди худро ҳар вақт то оғози интихобот иваз намояд. Шахси боэътимод наметавонад, ки узви ягон комиссияи ҳавзавии интихобот бошад. Шахсони боэътимод ҳангоми маҷлисҳои пешазинтихоботӣ бо ҳоҳиши номзадҳо ба вакилӣ метавонанд аз иҷрои вазифаҳои истеҳсолӣ ё хизматиашон озод бошанд, ки дар ин ҳол музди миёнаи корашон аз ҳисоби маблағи барои интихобот ҷудокарда пардохта мешавад. (ҚКҶТ аз 26.07.14 с., № 1087), (ҚКҶТ аз 30.05.2017 с. №1412)' : ' Кандидат в депутаты областного Маджлиса народных депутатов может иметь до трех, городского и районного Маджлиса – до двух доверенных лиц, которые помогают ему в проведении избирательной кампании, ведут агитацию за избрание его депутатом, представляют его интересы во взаимоотношениях с государственными и общественными органами, избирателями, а также в избирательных комиссиях. \n Кандидат в депутаты определяет доверенных лиц по своему усмотрению и сообщает о них для регистрации в окружную избирательную комиссию. Избирательная комиссия после регистрации доверенных лиц выдает им удостоверения. Кандидат в депутаты вправе в любое время до выборов заменить доверенных лиц. Доверенное лицо не может состоять ни в одной из избирательных комиссий округа. Доверенные лица на время проведения предвыборных собраний по просьбе кандидата в депутаты могут освобождаться от выполнения производственных или служебных обязанностей с сохранением средней заработной платы за счет средств, выделяемых на проведение выборов.'}
                    </Text>
                    <Text style={styles.listItem}>
                        {language === 'Тоҷики' ? 'Моддаи 34. Ташвиқоти пешазинтихоботӣ' : 'Статья 34. Предвыборная агитация'}
                    </Text>
                    <Text style={styles.textItem}>
                        {language === 'Тоҷики' ? ' Ташвиқоти пешазинтихоботӣ аз рӯзи бақайдгирии номзад оғоз гардида, як шабонарӯз пеш аз овоздиҳӣ қатъ мегардад. \n Ба ҳизбҳои сиёсӣ, ки ба вакилӣ номзад пешниҳод намудаанд ва ба намояндагони номзадҳои мустақил ҳуқуқ дода мешавад, ки ба тарафдории номзадҳои худ бе мамоният ташвиқот баранд, ҳамчунин барои гузаронидани маҷлису гирдиҳамоиҳо биноҳои таҷҳизонидашуда ва барои ташвиқоти пешазинтихоботӣ воситаҳои ахбори омма ҷудо намоянд. Ба шаҳрвандони Ҷумҳурии Тоҷикистон, ҳизбҳои сиёсӣ, кафолат дода мешавад, ки хислатҳои сиёсӣ, корӣ ва шахсии номзадҳоро ба вакилӣ озодона ва ҳаматарафа муҳокима намоянд, ҳамчунин онҳо ҳуқуқ доранд, ки дар маҷлисҳо, матбуот, радио ва телевизион ба тарафдорӣ ё зидди номзадҳо ташвиқот баранд. (ҚКҶТ аз 30.05.2017 с. №1412) \n Номзадҳо ба вакилӣ ҳуқуқ доранд воситаҳои ахбори оммаро бо асосҳои баробар истифода баранд, вохӯриҳои худро бо интихобкунандагон дар шакли барои ҳар ду ҷониб мувофиқ ташкил намоянд. Комиссияи участкавии интихобот якҷоя бо мақомоти иҷроияи маҳаллии ҳокимияти давлатӣ ва мақомоти худидоракунии шаҳрак ва деҳот барои гузаронидани вохӯриҳо мусоидат намуда, дар бораи вақту маҳалли баргузории вохӯриҳо ба интихобкунандагон хабар медиҳанд. \n Ба ташвиқоти пешазинтихоботӣ мубоҳисаҳо амали хос буда, бояд ҳодисаҳои беэҳтиромӣ нисбати ин ё он номзад ба вакилӣ роҳ дода нашавад. \n Ташвиқот дар рӯзи интихобот манъ аст. (ҚКҶТ аз 26.07.14 с., № 1087)' : ' Предвыборная агитация начинается со дня регистрации кандидата и завершается за сутки до голосования. \n Политическим партиям, выдвинувшим кандидатов в депутаты, и представителям независимых кандидатов предоставляется право беспрепятственной агитации за своих кандидатов, а также оборудованные помещения для собраний и митингов, средства массовой информации для ведения предвыборной агитации. Гражданам Республики Таджикистан, политическим партиям гарантируется возможность свободного и всестороннего обсуждения политических, деловых и личных качеств кандидатов в депутаты, а также право агитации "за" или "против" кандидатов на собраниях, в печати, по телевидению и радио. \n Кандидаты в депутаты вправе на равных основаниях использовать средства массовой информации, организовать встречи с избирателями в удобной для избирателей и кандидата форме. Участковая избирательная комиссия совместно с местными исполнительными органами государственной власти и органами самоуправления поселков и сел способствуют проведению встреч, оповещают избирателей о месте и времени проведения встреч. \n Предвыборная агитация должна вестись в рамках деловой, конструктивной дискуссии, исключая факты неуважительного отношения к тому или иному кандидату в депутаты. \n Агитация в день выборов запрещается. (КЗРТ от 26.07.14 г., № 1087)'}
                    </Text>
                    <Text style={styles.listItem}>
                        {language === 'Тоҷики' ? 'Моддаи 35. Барои иштирок дар маъракаи интихобот аз вазифаҳои хизматӣ ё истеҳсолӣ озод кардани номзадҳо ба вакилии Маҷлисҳои маҳаллии вакилони халқ' : 'Статья 35. Освобождение кандидата в депутаты местных Маджлисов народных депутатов от производственных или служебных обязанностей для участия в предвыборных мероприятиях'}
                    </Text>
                    <Text style={styles.textItem}>
                        {language === 'Тоҷики' ? ' Номзад ба вакилӣ баъди ба қайд гирифта шудан дар вақти гузаронидани вохӯриҳо бо интихобкунандагон, баромад кардан дар маҷлисҳои пешазинтихоботӣ, гирдиҳамоиҳо, аз тариқи телевизион ва радио, аз иҷрои вазифаҳои истеҳсолӣ ва хизматӣ озод карда мешавад, ки дар ин ҳол маоши миёнаи ӯ аз ҳисоби маблағи барои гузаронидани интихобот ҷудо карда, пардохта мешавад. (ҚКҶТ аз 26.07.14 с., № 1087)' : ' Статья 35. Освобождение кандидата в депутаты местных Маджлисов народных депутатов от производственных или служебных обязанностей для участия в предвыборных мероприятиях Кандидат в депутаты после регистрации на время проведения встреч с избирателями, выступлений на предвыборных собраниях, митингах, по телевидению и радио освобождается от выполнения производственных или служебных обязанностей с сохранением средней заработной платы за счет средств, выделяемых на проведение выборов.'}
                    </Text>
                    <Text style={styles.listItem}>
                        {language === 'Тоҷики' ? 'Моддаи 36. Ба бе пул сафар кардани номзад ҳақ доштани номзад ба вакилӣ' : 'Статья 36. Право кандидата в депутаты на бесплатный проезд'}
                    </Text>
                    <Text style={styles.textItem}>
                        {language === 'Тоҷики' ? ' Номзад ба вакилии Маҷлисҳои маҳаллии вакилони халқ баъди аз қайд гузаштан хуқуқ дорад бо тамоми намудҳои нақлиёти давлатии мусофиркаш (ба истиснои таксӣ) дар ҳудуди ҳавзаи интихоботӣ бе пул сафар кунад. Номзад ба вакилӣ, ки берун аз ҳудуди ҳавзаи интихобот зиндагӣ мекунад, барои ба ҳавзаи интихобот сафар кардан ва аз он ҷо ба манзил баргаштан ҳамин гуна ҳуқуқ дорад. (ҚКҶТ аз 30.05.2017 с. №1412)' : ' Кандидат в депутаты местных Маджлисов народных депутатов после регистрации имеет право на бесплатный проезд на всех видах государственного пассажирского транспорта (за исключением такси) в пределах соответствующего избирательного округа. Кандидат в депутаты, проживающий за пределами избирательного округа, пользуется таким же правом для проезда в избирательный округ и возвращения к местожительству.'}
                    </Text>
                    <Text style={styles.listItem}>
                        {language === 'Тоҷики' ? 'Моддаи 37. Дахлнопазирии номзад ба вакилӣ' : 'Статья 37. Неприкосновенность кандидата в депутаты'}
                    </Text>
                    <Text style={styles.textItem}>
                        {language === 'Тоҷики' ? ' Номзад ба вакилии Маҷлисҳои маҳаллии вакилони халқро ба истиснои дастгир намудани ӯ ҳангоми содири ҷиноят, бе розигии комиссияи дахлдори интихоботи вилоят, шаҳр, ноҳия ба ҷавобгирии ҷиноӣ кашида, ҳабс карда ё худ гирифтори чораҳои ҷазои маъмурие, ки суд муайян кардааст, шуда наметавонад.' : ' В случае выбытия кандидатов в депутаты после окончания срока регистрации кандидатов в депутаты, если в избирательном округе не остается других кандидатов, окружная избирательная комиссия с разрешения соответствующей областной, городской, районной избирательной комиссии обращается к органам политических партий и избирателям избирательного округа с предложением выдвинуть новых кандидатов в депутаты. \n При выбытии кандидатов в депутаты менее чем за пятнадцать дней до выборов выборы депутата от соответствующего избирательного округа проводится в двухмесячный срок после основных выборов.'}
                    </Text>
                </View>
            </ScrollView>
        </View>
    );
};

const styles = StyleSheet.create({
    webcontainer:{
        height: '100vh',
        overflow: 'scroll',
        paddingBottom: "20px",
        overflowX: "hidden",
      },
    container: {
        flex: 1,
    },
    backgroundImage: {
        position: 'absolute',
        top: '30%',
        width: '150%',
        left: -50,
        height: '40%',
        opacity: 0.4,
    },
    overlay: {
        ...StyleSheet.absoluteFillObject,
        backgroundColor: 'rgba(255, 255, 255, 0.5)',
    },
    scrollContent: {
        paddingHorizontal: 20,
        paddingTop: 20,
    },
    listContainer: {
        alignItems: 'flex-start',
    },
    listItem: {
        fontSize: 23.6,
        fontWeight: 'bold',
        color: '#000',
        marginBottom: 15,
    },
    textItem: {
        fontSize: 22,
        marginBottom: 15,
    },
});

export default Section2Page7;